LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
extern volatile PORT_PTEDSTR _PORT_PTED @0x00000004;
#define PORT_PTED                       _PORT_PTED.Byte
#define PORT_PTED_PTED0                 _PORT_PTED.Bits.PTED0
#define PORT_PTED_PTED1                 _PORT_PTED.Bits.PTED1
#define PORT_PTED_PTED2                 _PORT_PTED.Bits.PTED2
#define PORT_PTED_PTED3                 _PORT_PTED.Bits.PTED3
#define PORT_PTED_PTED4                 _PORT_PTED.Bits.PTED4
#define PORT_PTED_PTED5                 _PORT_PTED.Bits.PTED5
#define PORT_PTED_PTED6                 _PORT_PTED.Bits.PTED6
#define PORT_PTED_PTED7                 _PORT_PTED.Bits.PTED7

#define PORT_PTED_PTED0_MASK            0x01U
#define PORT_PTED_PTED1_MASK            0x02U
#define PORT_PTED_PTED2_MASK            0x04U
#define PORT_PTED_PTED3_MASK            0x08U
#define PORT_PTED_PTED4_MASK            0x10U
#define PORT_PTED_PTED5_MASK            0x20U
#define PORT_PTED_PTED6_MASK            0x40U
#define PORT_PTED_PTED7_MASK            0x80U


/*** PORT_PTFD - Port F Data Register; 0x00000005 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFD0       :1; 
    byte PTFD1       :1; 
    byte PTFD2       :1; 
    byte PTFD3       :1; 
    byte PTFD4       :1; 
    byte PTFD5       :1; 
    byte PTFD6       :1; 
    byte PTFD7       :1; 
  } Bits;
} PORT_PTFDSTR;
extern volatile PORT_PTFDSTR _PORT_PTFD @0x00000005;
#define PORT_PTFD                       _PORT_PTFD.Byte
#define PORT_PTFD_PTFD0                 _PORT_PTFD.Bits.PTFD0
#define PORT_PTFD_PTFD1                 _PORT_PTFD.Bits.PTFD1
#define PORT_PTFD_PTFD2                 _PORT_PTFD.Bits.PTFD2
#define PORT_PTFD_PTFD3                 _PORT_PTFD.Bits.PTFD3
#define PORT_PTFD_PTFD4                 _PORT_PTFD.Bits.PTFD4
#define PORT_PTFD_PTFD5                 _PORT_PTFD.Bits.PTFD5
#define PORT_PTFD_PTFD6                 _PORT_PTFD.Bits.PTFD6
#define PORT_PTFD_PTFD7                 _PORT_PTFD.Bits.PTFD7

#define PORT_PTFD_PTFD0_MASK            0x01U
#define PORT_PTFD_PTFD1_MASK            0x02U
#define PORT_PTFD_PTFD2_MASK            0x04U
#define PORT_PTFD_PTFD3_MASK            0x08U
#define PORT_PTFD_PTFD4_MASK            0x10U
#define PORT_PTFD_PTFD5_MASK            0x20U
#define PORT_PTFD_PTFD6_MASK            0x40U
#define PORT_PTFD_PTFD7_MASK            0x80U


/*** PORT_PTGD - Port G Data Register; 0x00000006 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGD0       :1; 
    byte PTGD1       :1; 
    byte PTGD2       :1; 
    byte PTGD3       :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGD :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PORT_PTGDSTR;
extern volatile PORT_PTGDSTR _PORT_PTGD @0x00000006;
#define PORT_PTGD                       _PORT_PTGD.Byte
#define PORT_PTGD_PTGD0                 _PORT_PTGD.Bits.PTGD0
#define PORT_PTGD_PTGD1                 _PORT_PTGD.Bits.PTGD1
#define PORT_PTGD_PTGD2                 _PORT_PTGD.Bits.PTGD2
#define PORT_PTGD_PTGD3                 _PORT_PTGD.Bits.PTGD3
#define PORT_PTGD_PTGD                  _PORT_PTGD.MergedBits.grpPTGD

#define PORT_PTGD_PTGD0_MASK            0x01U
#define PORT_PTGD_PTGD1_MASK            0x02U
#define PORT_PTGD_PTGD2_MASK            0x04U
#define PORT_PTGD_PTGD3_MASK            0x08U
#define PORT_PTGD_PTGD_MASK             0x0FU
#define PORT_PTGD_PTGD_BITNUM           0x00U


/*** PORT_PTHD - Port H Data Register; 0x00000007 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHD0       :1;                                       /* Port H Data Register Bit 0 */
    byte PTHD1       :1;                                       /* Port H Data Register Bit 1 */
    byte PTHD2       :1;                                       /* Port H Data Register Bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTHD6       :1;                                       /* Port H Data Register Bit 6 */
    byte PTHD7       :1;                                       /* Port H Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTHD :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTHD_6 :2;
  } MergedBits;
} PORT_PTHDSTR;
extern volatile PORT_PTHDSTR _PORT_PTHD @0x00000007;
#define PORT_PTHD                       _PORT_PTHD.Byte
#define PORT_PTHD_PTHD0                 _PORT_PTHD.Bits.PTHD0
#define PORT_PTHD_PTHD1                 _PORT_PTHD.Bits.PTHD1
#define PORT_PTHD_PTHD2                 _PORT_PTHD.Bits.PTHD2
#define PORT_PTHD_PTHD6                 _PORT_PTHD.Bits.PTHD6
#define PORT_PTHD_PTHD7                 _PORT_PTHD.Bits.PTHD7
#define PORT_PTHD_PTHD                  _PORT_PTHD.MergedBits.grpPTHD
#define PORT_PTHD_PTHD_6                _PORT_PTHD.MergedBits.grpPTHD_6

#define PORT_PTHD_PTHD0_MASK            0x01U
#define PORT_PTHD_PTHD1_MASK            0x02U
#define PORT_PTHD_PTHD2_MASK            0x04U
#define PORT_PTHD_PTHD6_MASK            0x40U
#define PORT_PTHD_PTHD7_MASK            0x80U
#define PORT_PTHD_PTHD_MASK             0x07U
#define PORT_PTHD_PTHD_BITNUM           0x00U
#define PORT_PTHD_PTHD_6_MASK           0xC0U
#define PORT_PTHD_PTHD_6_BITNUM         0x06U


/*** TSI_CS0 - TSI Control and Status Register 0; 0x00000008 ***/
typedef union {
  byte Byte;
  struct {
    byte SWTS        :1;                                       /* SWTS */
    byte CURSW       :1;                                       /* CURSW */
    byte EOSF        :1;                                       /* EOSF */
    byte SCNIP       :1;                                       /* SCNIP */
    byte STM         :1;                                       /* STM */
    byte STPE        :1;                                       /* STPE */
    byte TSIIEN      :1;                                       /* TSIIEN */
    byte TSIEN       :1;                                       /* TSIEN */
  } Bits;
} TSI_CS0STR;
extern volatile TSI_CS0STR _TSI_CS0 @0x00000008;
#define TSI_CS0                         _TSI_CS0.Byte
#define TSI_CS0_SWTS                    _TSI_CS0.Bits.SWTS
#define TSI_CS0_CURSW                   _TSI_CS0.Bits.CURSW
#define TSI_CS0_EOSF                    _TSI_CS0.Bits.EOSF
#define TSI_CS0_SCNIP                   _TSI_CS0.Bits.SCNIP
#define TSI_CS0_STM                     _TSI_CS0.Bits.STM
#define TSI_CS0_STPE                    _TSI_CS0.Bits.STPE
#define TSI_CS0_TSIIEN                  _TSI_CS0.Bits.TSIIEN
#define TSI_CS0_TSIEN                   _TSI_CS0.Bits.TSIEN
/* TSI_CS_ARR: Access 4 TSI_CSx registers in an array */
#define TSI_CS_ARR                      ((volatile byte * __far) &TSI_CS0)

#define TSI_CS0_SWTS_MASK               0x01U
#define TSI_CS0_CURSW_MASK              0x02U
#define TSI_CS0_EOSF_MASK               0x04U
#define TSI_CS0_SCNIP_MASK              0x08U
#define TSI_CS0_STM_MASK                0x10U
#define TSI_CS0_STPE_MASK               0x20U
#define TSI_CS0_TSIIEN_MASK             0x40U
#define TSI_CS0_TSIEN_MASK              0x80U


/*** TSI_CS1 - TSI Control and Status Register 1; 0x00000009 ***/
typedef union {
  byte Byte;
  struct {
    byte NSCN0       :1;                                       /* NSCN, bit 0 */
    byte NSCN1       :1;                                       /* NSCN, bit 1 */
    byte NSCN2       :1;                                       /* NSCN, bit 2 */
    byte NSCN3       :1;                                       /* NSCN, bit 3 */
    byte NSCN4       :1;                                       /* NSCN, bit 4 */
    byte PS0         :1;                                       /* PS, bit 0 */
    byte PS1         :1;                                       /* PS, bit 1 */
    byte PS2         :1;                                       /* PS, bit 2 */
  } Bits;
  struct {
    byte grpNSCN :5;
    byte grpPS   :3;
  } MergedBits;
} TSI_CS1STR;
