LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
#define SYS_ILLAL_ADDR0_MASK            0x01U
#define SYS_ILLAL_ADDR1_MASK            0x02U
#define SYS_ILLAL_ADDR2_MASK            0x04U
#define SYS_ILLAL_ADDR3_MASK            0x08U
#define SYS_ILLAL_ADDR4_MASK            0x10U
#define SYS_ILLAL_ADDR5_MASK            0x20U
#define SYS_ILLAL_ADDR6_MASK            0x40U
#define SYS_ILLAL_ADDR7_MASK            0x80U


/*** IPC_ILRS0 - Interrupt Level Setting Registers n; 0x00003050 ***/
typedef union {
  byte Byte;
  struct {
    byte ILRn00      :1;                                       /* Interrupt Level Register for Source n+0, bit 0 */
    byte ILRn01      :1;                                       /* Interrupt Level Register for Source n+0, bit 1 */
    byte ILRn10      :1;                                       /* Interrupt Level Register for Source n+1, bit 0 */
    byte ILRn11      :1;                                       /* Interrupt Level Register for Source n+1, bit 1 */
    byte ILRn20      :1;                                       /* Interrupt Level Register for Source n+2, bit 0 */
    byte ILRn21      :1;                                       /* Interrupt Level Register for Source n+2, bit 1 */
    byte ILRn30      :1;                                       /* Interrupt Level Register for Source n+3, bit 0 */
    byte ILRn31      :1;                                       /* Interrupt Level Register for Source n+3, bit 1 */
  } Bits;
  struct {
    byte grpILRn0 :2;
    byte grpILRn1 :2;
    byte grpILRn2 :2;
    byte grpILRn3 :2;
  } MergedBits;
} IPC_ILRS0STR;
extern volatile IPC_ILRS0STR _IPC_ILRS0 @0x00003050;
#define IPC_ILRS0                       _IPC_ILRS0.Byte
#define IPC_ILRS0_ILRn00                _IPC_ILRS0.Bits.ILRn00
#define IPC_ILRS0_ILRn01                _IPC_ILRS0.Bits.ILRn01
#define IPC_ILRS0_ILRn10                _IPC_ILRS0.Bits.ILRn10
#define IPC_ILRS0_ILRn11                _IPC_ILRS0.Bits.ILRn11
#define IPC_ILRS0_ILRn20                _IPC_ILRS0.Bits.ILRn20
#define IPC_ILRS0_ILRn21                _IPC_ILRS0.Bits.ILRn21
#define IPC_ILRS0_ILRn30                _IPC_ILRS0.Bits.ILRn30
#define IPC_ILRS0_ILRn31                _IPC_ILRS0.Bits.ILRn31
/* IPC_ILRS_ARR: Access 10 IPC_ILRSx registers in an array */
#define IPC_ILRS_ARR                    ((volatile byte * __far) &IPC_ILRS0)
#define IPC_ILRS0_ILRn0                 _IPC_ILRS0.MergedBits.grpILRn0
#define IPC_ILRS0_ILRn1                 _IPC_ILRS0.MergedBits.grpILRn1
#define IPC_ILRS0_ILRn2                 _IPC_ILRS0.MergedBits.grpILRn2
#define IPC_ILRS0_ILRn3                 _IPC_ILRS0.MergedBits.grpILRn3

#define IPC_ILRS0_ILRn00_MASK           0x01U
#define IPC_ILRS0_ILRn01_MASK           0x02U
#define IPC_ILRS0_ILRn10_MASK           0x04U
#define IPC_ILRS0_ILRn11_MASK           0x08U
#define IPC_ILRS0_ILRn20_MASK           0x10U
#define IPC_ILRS0_ILRn21_MASK           0x20U
#define IPC_ILRS0_ILRn30_MASK           0x40U
#define IPC_ILRS0_ILRn31_MASK           0x80U
#define IPC_ILRS0_ILRn0_MASK            0x03U
#define IPC_ILRS0_ILRn0_BITNUM          0x00U
#define IPC_ILRS0_ILRn1_MASK            0x0CU
#define IPC_ILRS0_ILRn1_BITNUM          0x02U
#define IPC_ILRS0_ILRn2_MASK            0x30U
#define IPC_ILRS0_ILRn2_BITNUM          0x04U
#define IPC_ILRS0_ILRn3_MASK            0xC0U
#define IPC_ILRS0_ILRn3_BITNUM          0x06U


/*** IPC_ILRS1 - Interrupt Level Setting Registers n; 0x00003051 ***/
typedef union {
  byte Byte;
  struct {
    byte ILRn00      :1;                                       /* Interrupt Level Register for Source n+0, bit 0 */
    byte ILRn01      :1;                                       /* Interrupt Level Register for Source n+0, bit 1 */
    byte ILRn10      :1;                                       /* Interrupt Level Register for Source n+1, bit 0 */
    byte ILRn11      :1;                                       /* Interrupt Level Register for Source n+1, bit 1 */
    byte ILRn20      :1;                                       /* Interrupt Level Register for Source n+2, bit 0 */
    byte ILRn21      :1;                                       /* Interrupt Level Register for Source n+2, bit 1 */
    byte ILRn30      :1;                                       /* Interrupt Level Register for Source n+3, bit 0 */
    byte ILRn31      :1;                                       /* Interrupt Level Register for Source n+3, bit 1 */
  } Bits;
  struct {
    byte grpILRn0 :2;
    byte grpILRn1 :2;
    byte grpILRn2 :2;
    byte grpILRn3 :2;
  } MergedBits;
} IPC_ILRS1STR;
extern volatile IPC_ILRS1STR _IPC_ILRS1 @0x00003051;
#define IPC_ILRS1                       _IPC_ILRS1.Byte
#define IPC_ILRS1_ILRn00                _IPC_ILRS1.Bits.ILRn00
#define IPC_ILRS1_ILRn01                _IPC_ILRS1.Bits.ILRn01
#define IPC_ILRS1_ILRn10                _IPC_ILRS1.Bits.ILRn10
#define IPC_ILRS1_ILRn11                _IPC_ILRS1.Bits.ILRn11
#define IPC_ILRS1_ILRn20                _IPC_ILRS1.Bits.ILRn20
#define IPC_ILRS1_ILRn21                _IPC_ILRS1.Bits.ILRn21
#define IPC_ILRS1_ILRn30                _IPC_ILRS1.Bits.ILRn30
#define IPC_ILRS1_ILRn31                _IPC_ILRS1.Bits.ILRn31
#define IPC_ILRS1_ILRn0                 _IPC_ILRS1.MergedBits.grpILRn0
#define IPC_ILRS1_ILRn1                 _IPC_ILRS1.MergedBits.grpILRn1
#define IPC_ILRS1_ILRn2                 _IPC_ILRS1.MergedBits.grpILRn2
#define IPC_ILRS1_ILRn3                 _IPC_ILRS1.MergedBits.grpILRn3

#define IPC_ILRS1_ILRn00_MASK           0x01U
#define IPC_ILRS1_ILRn01_MASK           0x02U
#define IPC_ILRS1_ILRn10_MASK           0x04U
#define IPC_ILRS1_ILRn11_MASK           0x08U
#define IPC_ILRS1_ILRn20_MASK           0x10U
#define IPC_ILRS1_ILRn21_MASK           0x20U
#define IPC_ILRS1_ILRn30_MASK           0x40U
#define IPC_ILRS1_ILRn31_MASK           0x80U
#define IPC_ILRS1_ILRn0_MASK            0x03U
#define IPC_ILRS1_ILRn0_BITNUM          0x00U
#define IPC_ILRS1_ILRn1_MASK            0x0CU
#define IPC_ILRS1_ILRn1_BITNUM          0x02U
#define IPC_ILRS1_ILRn2_MASK            0x30U
#define IPC_ILRS1_ILRn2_BITNUM          0x04U
#define IPC_ILRS1_ILRn3_MASK            0xC0U
#define IPC_ILRS1_ILRn3_BITNUM          0x06U


