LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
extern volatile IPC_ILRS9STR _IPC_ILRS9 @0x00003059;
#define IPC_ILRS9                       _IPC_ILRS9.Byte
#define IPC_ILRS9_ILRn00                _IPC_ILRS9.Bits.ILRn00
#define IPC_ILRS9_ILRn01                _IPC_ILRS9.Bits.ILRn01
#define IPC_ILRS9_ILRn10                _IPC_ILRS9.Bits.ILRn10
#define IPC_ILRS9_ILRn11                _IPC_ILRS9.Bits.ILRn11
#define IPC_ILRS9_ILRn20                _IPC_ILRS9.Bits.ILRn20
#define IPC_ILRS9_ILRn21                _IPC_ILRS9.Bits.ILRn21
#define IPC_ILRS9_ILRn30                _IPC_ILRS9.Bits.ILRn30
#define IPC_ILRS9_ILRn31                _IPC_ILRS9.Bits.ILRn31
#define IPC_ILRS9_ILRn0                 _IPC_ILRS9.MergedBits.grpILRn0
#define IPC_ILRS9_ILRn1                 _IPC_ILRS9.MergedBits.grpILRn1
#define IPC_ILRS9_ILRn2                 _IPC_ILRS9.MergedBits.grpILRn2
#define IPC_ILRS9_ILRn3                 _IPC_ILRS9.MergedBits.grpILRn3

#define IPC_ILRS9_ILRn00_MASK           0x01U
#define IPC_ILRS9_ILRn01_MASK           0x02U
#define IPC_ILRS9_ILRn10_MASK           0x04U
#define IPC_ILRS9_ILRn11_MASK           0x08U
#define IPC_ILRS9_ILRn20_MASK           0x10U
#define IPC_ILRS9_ILRn21_MASK           0x20U
#define IPC_ILRS9_ILRn30_MASK           0x40U
#define IPC_ILRS9_ILRn31_MASK           0x80U
#define IPC_ILRS9_ILRn0_MASK            0x03U
#define IPC_ILRS9_ILRn0_BITNUM          0x00U
#define IPC_ILRS9_ILRn1_MASK            0x0CU
#define IPC_ILRS9_ILRn1_BITNUM          0x02U
#define IPC_ILRS9_ILRn2_MASK            0x30U
#define IPC_ILRS9_ILRn2_BITNUM          0x04U
#define IPC_ILRS9_ILRn3_MASK            0xC0U
#define IPC_ILRS9_ILRn3_BITNUM          0x06U


/*** CRC_D0D1 - CRC_D0D1 register; 0x00003060 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CRC_D0 - CRC Data 0 Register; 0x00003060 ***/
    union {
      byte Byte;
      struct {
        byte DH00        :1;                                       /* CRC Data Bit 31:24, bit 0 */
        byte DH01        :1;                                       /* CRC Data Bit 31:24, bit 1 */
        byte DH02        :1;                                       /* CRC Data Bit 31:24, bit 2 */
        byte DH03        :1;                                       /* CRC Data Bit 31:24, bit 3 */
        byte DH04        :1;                                       /* CRC Data Bit 31:24, bit 4 */
        byte DH05        :1;                                       /* CRC Data Bit 31:24, bit 5 */
        byte DH06        :1;                                       /* CRC Data Bit 31:24, bit 6 */
        byte DH07        :1;                                       /* CRC Data Bit 31:24, bit 7 */
      } Bits;
    } CRC_D0STR;
    #define CRC_D0                      _CRC_D0D1.Overlap_STR.CRC_D0STR.Byte
    #define CRC_D0_DH00                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH00
    #define CRC_D0_DH01                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH01
    #define CRC_D0_DH02                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH02
    #define CRC_D0_DH03                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH03
    #define CRC_D0_DH04                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH04
    #define CRC_D0_DH05                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH05
    #define CRC_D0_DH06                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH06
    #define CRC_D0_DH07                 _CRC_D0D1.Overlap_STR.CRC_D0STR.Bits.DH07
    /* CRC_D_ARR: Access 4 CRC_Dx registers in an array */
    #define CRC_D_ARR                   ((volatile byte * __far) &CRC_D0)
    
    #define CRC_D0_DH00_MASK            0x01U
    #define CRC_D0_DH01_MASK            0x02U
    #define CRC_D0_DH02_MASK            0x04U
    #define CRC_D0_DH03_MASK            0x08U
    #define CRC_D0_DH04_MASK            0x10U
    #define CRC_D0_DH05_MASK            0x20U
    #define CRC_D0_DH06_MASK            0x40U
    #define CRC_D0_DH07_MASK            0x80U
    

    /*** CRC_D1 - CRC Data 1 Register; 0x00003061 ***/
    union {
      byte Byte;
      struct {
        byte D10         :1;                                       /* CRC Data Bit 23:16, bit 0 */
        byte D11         :1;                                       /* CRC Data Bit 23:16, bit 1 */
        byte D12         :1;                                       /* CRC Data Bit 23:16, bit 2 */
        byte D13         :1;                                       /* CRC Data Bit 23:16, bit 3 */
        byte D14         :1;                                       /* CRC Data Bit 23:16, bit 4 */
        byte D15         :1;                                       /* CRC Data Bit 23:16, bit 5 */
        byte D16         :1;                                       /* CRC Data Bit 23:16, bit 6 */
        byte D17         :1;                                       /* CRC Data Bit 23:16, bit 7 */
      } Bits;
    } CRC_D1STR;
    #define CRC_D1                      _CRC_D0D1.Overlap_STR.CRC_D1STR.Byte
    #define CRC_D1_D10                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D10
    #define CRC_D1_D11                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D11
    #define CRC_D1_D12                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D12
    #define CRC_D1_D13                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D13
    #define CRC_D1_D14                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D14
    #define CRC_D1_D15                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D15
    #define CRC_D1_D16                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D16
    #define CRC_D1_D17                  _CRC_D0D1.Overlap_STR.CRC_D1STR.Bits.D17
    
    #define CRC_D1_D10_MASK             0x01U
    #define CRC_D1_D11_MASK             0x02U
    #define CRC_D1_D12_MASK             0x04U
    #define CRC_D1_D13_MASK             0x08U
    #define CRC_D1_D14_MASK             0x10U
    #define CRC_D1_D15_MASK             0x20U
    #define CRC_D1_D16_MASK             0x40U
    #define CRC_D1_D17_MASK             0x80U
    
  } Overlap_STR;

} CRC_D0D1STR;
extern volatile CRC_D0D1STR _CRC_D0D1 @0x00003060;
#define CRC_D0D1                        _CRC_D0D1.Word


/*** CRC_D2D3 - CRC_D2D3 register; 0x00003062 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CRC_D2 - CRC Data 2 Register; 0x00003062 ***/
    union {
      byte Byte;
      struct {
        byte D20         :1;                                       /* CRC Data Bit 15:8, bit 0 */
        byte D21         :1;                                       /* CRC Data Bit 15:8, bit 1 */
        byte D22         :1;                                       /* CRC Data Bit 15:8, bit 2 */
        byte D23         :1;                                       /* CRC Data Bit 15:8, bit 3 */
        byte D24         :1;                                       /* CRC Data Bit 15:8, bit 4 */
        byte D25         :1;                                       /* CRC Data Bit 15:8, bit 5 */
        byte D26         :1;                                       /* CRC Data Bit 15:8, bit 6 */
        byte D27         :1;                                       /* CRC Data Bit 15:8, bit 7 */
      } Bits;
    } CRC_D2STR;
    #define CRC_D2                      _CRC_D2D3.Overlap_STR.CRC_D2STR.Byte
    #define CRC_D2_D20                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D20
    #define CRC_D2_D21                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D21
    #define CRC_D2_D22                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D22
    #define CRC_D2_D23                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D23
    #define CRC_D2_D24                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D24
    #define CRC_D2_D25                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D25
    #define CRC_D2_D26                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D26
    #define CRC_D2_D27                  _CRC_D2D3.Overlap_STR.CRC_D2STR.Bits.D27
    
    #define CRC_D2_D20_MASK             0x01U
    #define CRC_D2_D21_MASK             0x02U
    #define CRC_D2_D22_MASK             0x04U
    #define CRC_D2_D23_MASK             0x08U
    #define CRC_D2_D24_MASK             0x10U
    #define CRC_D2_D25_MASK             0x20U
    #define CRC_D2_D26_MASK             0x40U
    #define CRC_D2_D27_MASK             0x80U
    

