LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
    /*** CRC_D3 - CRC Data 3 Register; 0x00003063 ***/
    union {
      byte Byte;
      struct {
        byte D30         :1;                                       /* CRC Data Bit 7:0, bit 0 */
        byte D31         :1;                                       /* CRC Data Bit 7:0, bit 1 */
        byte D32         :1;                                       /* CRC Data Bit 7:0, bit 2 */
        byte D33         :1;                                       /* CRC Data Bit 7:0, bit 3 */
        byte D34         :1;                                       /* CRC Data Bit 7:0, bit 4 */
        byte D35         :1;                                       /* CRC Data Bit 7:0, bit 5 */
        byte D36         :1;                                       /* CRC Data Bit 7:0, bit 6 */
        byte D37         :1;                                       /* CRC Data Bit 7:0, bit 7 */
      } Bits;
    } CRC_D3STR;
    #define CRC_D3                      _CRC_D2D3.Overlap_STR.CRC_D3STR.Byte
    #define CRC_D3_D30                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D30
    #define CRC_D3_D31                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D31
    #define CRC_D3_D32                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D32
    #define CRC_D3_D33                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D33
    #define CRC_D3_D34                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D34
    #define CRC_D3_D35                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D35
    #define CRC_D3_D36                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D36
    #define CRC_D3_D37                  _CRC_D2D3.Overlap_STR.CRC_D3STR.Bits.D37
    
    #define CRC_D3_D30_MASK             0x01U
    #define CRC_D3_D31_MASK             0x02U
    #define CRC_D3_D32_MASK             0x04U
    #define CRC_D3_D33_MASK             0x08U
    #define CRC_D3_D34_MASK             0x10U
    #define CRC_D3_D35_MASK             0x20U
    #define CRC_D3_D36_MASK             0x40U
    #define CRC_D3_D37_MASK             0x80U
    
  } Overlap_STR;

} CRC_D2D3STR;
extern volatile CRC_D2D3STR _CRC_D2D3 @0x00003062;
#define CRC_D2D3                        _CRC_D2D3.Word


/*** CRC_P0P1 - CRC_P0P1 register; 0x00003064 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CRC_P0 - CRC Polynomial 0 Register; 0x00003064 ***/
    union {
      byte Byte;
      struct {
        byte P00         :1;                                       /* CRC Polynominal Bit 31:24, bit 0 */
        byte P01         :1;                                       /* CRC Polynominal Bit 31:24, bit 1 */
        byte P02         :1;                                       /* CRC Polynominal Bit 31:24, bit 2 */
        byte P03         :1;                                       /* CRC Polynominal Bit 31:24, bit 3 */
        byte P04         :1;                                       /* CRC Polynominal Bit 31:24, bit 4 */
        byte P05         :1;                                       /* CRC Polynominal Bit 31:24, bit 5 */
        byte P06         :1;                                       /* CRC Polynominal Bit 31:24, bit 6 */
        byte P07         :1;                                       /* CRC Polynominal Bit 31:24, bit 7 */
      } Bits;
    } CRC_P0STR;
    #define CRC_P0                      _CRC_P0P1.Overlap_STR.CRC_P0STR.Byte
    #define CRC_P0_P00                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P00
    #define CRC_P0_P01                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P01
    #define CRC_P0_P02                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P02
    #define CRC_P0_P03                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P03
    #define CRC_P0_P04                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P04
    #define CRC_P0_P05                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P05
    #define CRC_P0_P06                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P06
    #define CRC_P0_P07                  _CRC_P0P1.Overlap_STR.CRC_P0STR.Bits.P07
    /* CRC_P_ARR: Access 4 CRC_Px registers in an array */
    #define CRC_P_ARR                   ((volatile byte * __far) &CRC_P0)
    
    #define CRC_P0_P00_MASK             0x01U
    #define CRC_P0_P01_MASK             0x02U
    #define CRC_P0_P02_MASK             0x04U
    #define CRC_P0_P03_MASK             0x08U
    #define CRC_P0_P04_MASK             0x10U
    #define CRC_P0_P05_MASK             0x20U
    #define CRC_P0_P06_MASK             0x40U
    #define CRC_P0_P07_MASK             0x80U
    

    /*** CRC_P1 - CRC Polynomial 1 Register; 0x00003065 ***/
    union {
      byte Byte;
      struct {
        byte P10         :1;                                       /* CRC Polynominal Bit 23:16, bit 0 */
        byte P11         :1;                                       /* CRC Polynominal Bit 23:16, bit 1 */
        byte P12         :1;                                       /* CRC Polynominal Bit 23:16, bit 2 */
        byte P13         :1;                                       /* CRC Polynominal Bit 23:16, bit 3 */
        byte P14         :1;                                       /* CRC Polynominal Bit 23:16, bit 4 */
        byte P15         :1;                                       /* CRC Polynominal Bit 23:16, bit 5 */
        byte P16         :1;                                       /* CRC Polynominal Bit 23:16, bit 6 */
        byte P17         :1;                                       /* CRC Polynominal Bit 23:16, bit 7 */
      } Bits;
    } CRC_P1STR;
    #define CRC_P1                      _CRC_P0P1.Overlap_STR.CRC_P1STR.Byte
    #define CRC_P1_P10                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P10
    #define CRC_P1_P11                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P11
    #define CRC_P1_P12                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P12
    #define CRC_P1_P13                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P13
    #define CRC_P1_P14                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P14
    #define CRC_P1_P15                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P15
    #define CRC_P1_P16                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P16
    #define CRC_P1_P17                  _CRC_P0P1.Overlap_STR.CRC_P1STR.Bits.P17
    
