LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
    #define CRC_P1_P10_MASK             0x01U
    #define CRC_P1_P11_MASK             0x02U
    #define CRC_P1_P12_MASK             0x04U
    #define CRC_P1_P13_MASK             0x08U
    #define CRC_P1_P14_MASK             0x10U
    #define CRC_P1_P15_MASK             0x20U
    #define CRC_P1_P16_MASK             0x40U
    #define CRC_P1_P17_MASK             0x80U
    
  } Overlap_STR;

} CRC_P0P1STR;
extern volatile CRC_P0P1STR _CRC_P0P1 @0x00003064;
#define CRC_P0P1                        _CRC_P0P1.Word


/*** CRC_P2P3 - CRC_P2P3 register; 0x00003066 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CRC_P2 - CRC Polynomial 2 Register; 0x00003066 ***/
    union {
      byte Byte;
      struct {
        byte P20         :1;                                       /* CRC Polynominal Bit 15:8, bit 0 */
        byte P21         :1;                                       /* CRC Polynominal Bit 15:8, bit 1 */
        byte P22         :1;                                       /* CRC Polynominal Bit 15:8, bit 2 */
        byte P23         :1;                                       /* CRC Polynominal Bit 15:8, bit 3 */
        byte P24         :1;                                       /* CRC Polynominal Bit 15:8, bit 4 */
        byte P25         :1;                                       /* CRC Polynominal Bit 15:8, bit 5 */
        byte P26         :1;                                       /* CRC Polynominal Bit 15:8, bit 6 */
        byte P27         :1;                                       /* CRC Polynominal Bit 15:8, bit 7 */
      } Bits;
    } CRC_P2STR;
    #define CRC_P2                      _CRC_P2P3.Overlap_STR.CRC_P2STR.Byte
    #define CRC_P2_P20                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P20
    #define CRC_P2_P21                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P21
    #define CRC_P2_P22                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P22
    #define CRC_P2_P23                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P23
    #define CRC_P2_P24                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P24
    #define CRC_P2_P25                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P25
    #define CRC_P2_P26                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P26
    #define CRC_P2_P27                  _CRC_P2P3.Overlap_STR.CRC_P2STR.Bits.P27
    
    #define CRC_P2_P20_MASK             0x01U
    #define CRC_P2_P21_MASK             0x02U
    #define CRC_P2_P22_MASK             0x04U
    #define CRC_P2_P23_MASK             0x08U
    #define CRC_P2_P24_MASK             0x10U
    #define CRC_P2_P25_MASK             0x20U
    #define CRC_P2_P26_MASK             0x40U
    #define CRC_P2_P27_MASK             0x80U
    

    /*** CRC_P3 - CRC Polynomial 3 Register; 0x00003067 ***/
    union {
      byte Byte;
      struct {
        byte P30         :1;                                       /* CRC Polynominal Bit 7:0, bit 0 */
        byte P31         :1;                                       /* CRC Polynominal Bit 7:0, bit 1 */
        byte P32         :1;                                       /* CRC Polynominal Bit 7:0, bit 2 */
        byte P33         :1;                                       /* CRC Polynominal Bit 7:0, bit 3 */
        byte P34         :1;                                       /* CRC Polynominal Bit 7:0, bit 4 */
        byte P35         :1;                                       /* CRC Polynominal Bit 7:0, bit 5 */
        byte P36         :1;                                       /* CRC Polynominal Bit 7:0, bit 6 */
        byte P37         :1;                                       /* CRC Polynominal Bit 7:0, bit 7 */
      } Bits;
    } CRC_P3STR;
    #define CRC_P3                      _CRC_P2P3.Overlap_STR.CRC_P3STR.Byte
    #define CRC_P3_P30                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P30
    #define CRC_P3_P31                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P31
    #define CRC_P3_P32                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P32
    #define CRC_P3_P33                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P33
    #define CRC_P3_P34                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P34
    #define CRC_P3_P35                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P35
    #define CRC_P3_P36                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P36
    #define CRC_P3_P37                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P37
    
    #define CRC_P3_P30_MASK             0x01U
    #define CRC_P3_P31_MASK             0x02U
    #define CRC_P3_P32_MASK             0x04U
    #define CRC_P3_P33_MASK             0x08U
    #define CRC_P3_P34_MASK             0x10U
    #define CRC_P3_P35_MASK             0x20U
    #define CRC_P3_P36_MASK             0x40U
    #define CRC_P3_P37_MASK             0x80U
    
  } Overlap_STR;

} CRC_P2P3STR;
extern volatile CRC_P2P3STR _CRC_P2P3 @0x00003066;
#define CRC_P2P3                        _CRC_P2P3.Word


/*** CRC_CTRL - CRC Control Register; 0x00003068 ***/
typedef union {
  byte Byte;
  struct {
    byte TCRC        :1;                                       /* Width of Polynomial Generator */
    byte WAS         :1;                                       /* Write CRC data register as seed */
    byte FXOR        :1;                                       /* Complement of Read */
    byte             :1; 
    byte TOTR0       :1;                                       /* Reverse of Read, bit 0 */
    byte TOTR1       :1;                                       /* Reverse of Read, bit 1 */
    byte TOT0        :1;                                       /* Reverse of Write, bit 0 */
    byte TOT1        :1;                                       /* Reverse of Write, bit 1 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpTOTR :2;
    byte grpTOT  :2;
  } MergedBits;
} CRC_CTRLSTR;
extern volatile CRC_CTRLSTR _CRC_CTRL @0x00003068;
#define CRC_CTRL                        _CRC_CTRL.Byte
#define CRC_CTRL_TCRC                   _CRC_CTRL.Bits.TCRC
#define CRC_CTRL_WAS                    _CRC_CTRL.Bits.WAS
#define CRC_CTRL_FXOR                   _CRC_CTRL.Bits.FXOR
#define CRC_CTRL_TOTR0                  _CRC_CTRL.Bits.TOTR0
#define CRC_CTRL_TOTR1                  _CRC_CTRL.Bits.TOTR1
#define CRC_CTRL_TOT0                   _CRC_CTRL.Bits.TOT0
#define CRC_CTRL_TOT1                   _CRC_CTRL.Bits.TOT1
#define CRC_CTRL_TOTR                   _CRC_CTRL.MergedBits.grpTOTR
#define CRC_CTRL_TOT                    _CRC_CTRL.MergedBits.grpTOT

#define CRC_CTRL_TCRC_MASK              0x01U
#define CRC_CTRL_WAS_MASK               0x02U
#define CRC_CTRL_FXOR_MASK              0x04U
#define CRC_CTRL_TOTR0_MASK             0x10U
#define CRC_CTRL_TOTR1_MASK             0x20U
#define CRC_CTRL_TOT0_MASK              0x40U
#define CRC_CTRL_TOT1_MASK              0x80U
#define CRC_CTRL_TOTR_MASK              0x30U
#define CRC_CTRL_TOTR_BITNUM            0x04U
#define CRC_CTRL_TOT_MASK               0xC0U
#define CRC_CTRL_TOT_BITNUM             0x06U


/*** RTC_SC1 - RTC Status and Control Register 1; 0x0000306A ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RTCO        :1;                                       /* Real-Time Counter Output */
    byte             :1; 
    byte RTIE        :1;                                       /* Real-Time Interrupt Enable */
    byte RTIF        :1;                                       /* Real-Time Interrupt Flag */
  } Bits;
} RTC_SC1STR;
