LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
extern volatile I2C_SSTR _I2C_S @0x00003073;
#define I2C_S                           _I2C_S.Byte
#define I2C_S_RXAK                      _I2C_S.Bits.RXAK
#define I2C_S_IICIF                     _I2C_S.Bits.IICIF
#define I2C_S_SRW                       _I2C_S.Bits.SRW
#define I2C_S_RAM                       _I2C_S.Bits.RAM
#define I2C_S_ARBL                      _I2C_S.Bits.ARBL
#define I2C_S_BUSY                      _I2C_S.Bits.BUSY
#define I2C_S_IAAS                      _I2C_S.Bits.IAAS
#define I2C_S_TCF                       _I2C_S.Bits.TCF

#define I2C_S_RXAK_MASK                 0x01U
#define I2C_S_IICIF_MASK                0x02U
#define I2C_S_SRW_MASK                  0x04U
#define I2C_S_RAM_MASK                  0x08U
#define I2C_S_ARBL_MASK                 0x10U
#define I2C_S_BUSY_MASK                 0x20U
#define I2C_S_IAAS_MASK                 0x40U
#define I2C_S_TCF_MASK                  0x80U


/*** I2C_D - I2C Data I/O register; 0x00003074 ***/
typedef union {
  byte Byte;
  struct {
    byte DATA0       :1;                                       /* Data, bit 0 */
    byte DATA1       :1;                                       /* Data, bit 1 */
    byte DATA2       :1;                                       /* Data, bit 2 */
    byte DATA3       :1;                                       /* Data, bit 3 */
    byte DATA4       :1;                                       /* Data, bit 4 */
    byte DATA5       :1;                                       /* Data, bit 5 */
    byte DATA6       :1;                                       /* Data, bit 6 */
    byte DATA7       :1;                                       /* Data, bit 7 */
  } Bits;
} I2C_DSTR;
extern volatile I2C_DSTR _I2C_D @0x00003074;
#define I2C_D                           _I2C_D.Byte
#define I2C_D_DATA0                     _I2C_D.Bits.DATA0
#define I2C_D_DATA1                     _I2C_D.Bits.DATA1
#define I2C_D_DATA2                     _I2C_D.Bits.DATA2
#define I2C_D_DATA3                     _I2C_D.Bits.DATA3
#define I2C_D_DATA4                     _I2C_D.Bits.DATA4
#define I2C_D_DATA5                     _I2C_D.Bits.DATA5
#define I2C_D_DATA6                     _I2C_D.Bits.DATA6
#define I2C_D_DATA7                     _I2C_D.Bits.DATA7

#define I2C_D_DATA0_MASK                0x01U
#define I2C_D_DATA1_MASK                0x02U
#define I2C_D_DATA2_MASK                0x04U
#define I2C_D_DATA3_MASK                0x08U
#define I2C_D_DATA4_MASK                0x10U
#define I2C_D_DATA5_MASK                0x20U
#define I2C_D_DATA6_MASK                0x40U
#define I2C_D_DATA7_MASK                0x80U


/*** I2C_C2 - I2C Control Register 2; 0x00003075 ***/
typedef union {
  byte Byte;
  struct {
    byte AD8         :1; 
    byte AD9         :1; 
    byte AD10        :1; 
    byte RMEN        :1;                                       /* Range address matching enable */
    byte SBRC        :1;                                       /* Slave baud rate control */
    byte HDRS        :1;                                       /* High drive select */
    byte ADEXT       :1;                                       /* Address extension */
    byte GCAEN       :1;                                       /* General call address enable */
  } Bits;
  struct {
    byte grpAD_8 :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} I2C_C2STR;
extern volatile I2C_C2STR _I2C_C2 @0x00003075;
#define I2C_C2                          _I2C_C2.Byte
#define I2C_C2_AD8                      _I2C_C2.Bits.AD8
#define I2C_C2_AD9                      _I2C_C2.Bits.AD9
#define I2C_C2_AD10                     _I2C_C2.Bits.AD10
#define I2C_C2_RMEN                     _I2C_C2.Bits.RMEN
#define I2C_C2_SBRC                     _I2C_C2.Bits.SBRC
#define I2C_C2_HDRS                     _I2C_C2.Bits.HDRS
#define I2C_C2_ADEXT                    _I2C_C2.Bits.ADEXT
#define I2C_C2_GCAEN                    _I2C_C2.Bits.GCAEN
#define I2C_C2_AD_8                     _I2C_C2.MergedBits.grpAD_8
#define I2C_C2_AD                       I2C_C2_AD_8

#define I2C_C2_AD8_MASK                 0x01U
#define I2C_C2_AD9_MASK                 0x02U
#define I2C_C2_AD10_MASK                0x04U
#define I2C_C2_RMEN_MASK                0x08U
#define I2C_C2_SBRC_MASK                0x10U
#define I2C_C2_HDRS_MASK                0x20U
#define I2C_C2_ADEXT_MASK               0x40U
#define I2C_C2_GCAEN_MASK               0x80U
#define I2C_C2_AD_8_MASK                0x07U
#define I2C_C2_AD_8_BITNUM              0x00U


/*** I2C_FLT - I2C Programmable Input Glitch Filter register; 0x00003076 ***/
typedef union {
  byte Byte;
  struct {
    byte FLT0        :1;                                       /* I2C programmable filter factor, bit 0 */
    byte FLT1        :1;                                       /* I2C programmable filter factor, bit 1 */
    byte FLT2        :1;                                       /* I2C programmable filter factor, bit 2 */
    byte FLT3        :1;                                       /* I2C programmable filter factor, bit 3 */
    byte FLT4        :1;                                       /* I2C programmable filter factor, bit 4 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpFLT  :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} I2C_FLTSTR;
extern volatile I2C_FLTSTR _I2C_FLT @0x00003076;
#define I2C_FLT                         _I2C_FLT.Byte
#define I2C_FLT_FLT0                    _I2C_FLT.Bits.FLT0
#define I2C_FLT_FLT1                    _I2C_FLT.Bits.FLT1
#define I2C_FLT_FLT2                    _I2C_FLT.Bits.FLT2
#define I2C_FLT_FLT3                    _I2C_FLT.Bits.FLT3
#define I2C_FLT_FLT4                    _I2C_FLT.Bits.FLT4
#define I2C_FLT_FLT                     _I2C_FLT.MergedBits.grpFLT

#define I2C_FLT_FLT0_MASK               0x01U
#define I2C_FLT_FLT1_MASK               0x02U
#define I2C_FLT_FLT2_MASK               0x04U
#define I2C_FLT_FLT3_MASK               0x08U
#define I2C_FLT_FLT4_MASK               0x10U
#define I2C_FLT_FLT_MASK                0x1FU
#define I2C_FLT_FLT_BITNUM              0x00U


/*** I2C_RA - I2C Range Address register; 0x00003077 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte RAD0        :1;                                       /* Range slave address, bit 0 */
    byte RAD1        :1;                                       /* Range slave address, bit 1 */
    byte RAD2        :1;                                       /* Range slave address, bit 2 */
    byte RAD3        :1;                                       /* Range slave address, bit 3 */
    byte RAD4        :1;                                       /* Range slave address, bit 4 */
    byte RAD5        :1;                                       /* Range slave address, bit 5 */
    byte RAD6        :1;                                       /* Range slave address, bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpRAD  :7;
  } MergedBits;
} I2C_RASTR;
extern volatile I2C_RASTR _I2C_RA @0x00003077;
#define I2C_RA                          _I2C_RA.Byte
#define I2C_RA_RAD0                     _I2C_RA.Bits.RAD0
#define I2C_RA_RAD1                     _I2C_RA.Bits.RAD1
#define I2C_RA_RAD2                     _I2C_RA.Bits.RAD2
#define I2C_RA_RAD3                     _I2C_RA.Bits.RAD3
#define I2C_RA_RAD4                     _I2C_RA.Bits.RAD4
#define I2C_RA_RAD5                     _I2C_RA.Bits.RAD5
#define I2C_RA_RAD6                     _I2C_RA.Bits.RAD6
#define I2C_RA_RAD                      _I2C_RA.MergedBits.grpRAD

#define I2C_RA_RAD0_MASK                0x02U
#define I2C_RA_RAD1_MASK                0x04U
#define I2C_RA_RAD2_MASK                0x08U
#define I2C_RA_RAD3_MASK                0x10U
#define I2C_RA_RAD4_MASK                0x20U
#define I2C_RA_RAD5_MASK                0x40U
#define I2C_RA_RAD6_MASK                0x80U
#define I2C_RA_RAD_MASK                 0xFEU
#define I2C_RA_RAD_BITNUM               0x01U


/*** I2C_SMB - I2C SMBus Control and Status register; 0x00003078 ***/
typedef union {
  byte Byte;
  struct {
    byte SHTF2IE     :1;                                       /* SHTF2 interrupt enable */
    byte SHTF2       :1;                                       /* SCL high timeout flag 2 */
    byte SHTF1       :1;                                       /* SCL high timeout flag 1 */
    byte SLTF        :1;                                       /* SCL low timeout flag */
    byte TCKSEL      :1;                                       /* Timeout counter clock select */
    byte SIICAEN     :1;                                       /* Second I2C address enable */
    byte ALERTEN     :1;                                       /* SMBus alert response address enable */
    byte FACK        :1;                                       /* Fast NACK/ACK enable */
  } Bits;
} I2C_SMBSTR;
extern volatile I2C_SMBSTR _I2C_SMB @0x00003078;
#define I2C_SMB                         _I2C_SMB.Byte
#define I2C_SMB_SHTF2IE                 _I2C_SMB.Bits.SHTF2IE
#define I2C_SMB_SHTF2                   _I2C_SMB.Bits.SHTF2
#define I2C_SMB_SHTF1                   _I2C_SMB.Bits.SHTF1
#define I2C_SMB_SLTF                    _I2C_SMB.Bits.SLTF
#define I2C_SMB_TCKSEL                  _I2C_SMB.Bits.TCKSEL
#define I2C_SMB_SIICAEN                 _I2C_SMB.Bits.SIICAEN
#define I2C_SMB_ALERTEN                 _I2C_SMB.Bits.ALERTEN
#define I2C_SMB_FACK                    _I2C_SMB.Bits.FACK

