LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
#define SCI1_C3_PEIE_MASK               0x01U
#define SCI1_C3_FEIE_MASK               0x02U
#define SCI1_C3_NEIE_MASK               0x04U
#define SCI1_C3_ORIE_MASK               0x08U
#define SCI1_C3_TXINV_MASK              0x10U
#define SCI1_C3_TXDIR_MASK              0x20U
#define SCI1_C3_T8_MASK                 0x40U
#define SCI1_C3_R8_MASK                 0x80U


/*** SCI1_D - SCI Data Register; 0x0000308F ***/
typedef union {
  byte Byte;
  struct {
    byte R0T0        :1;                                       /* Read receive data buffer 0 or write transmit data buffer 0 */
    byte R1T1        :1;                                       /* Read receive data buffer 1 or write transmit data buffer 1 */
    byte R2T2        :1;                                       /* Read receive data buffer 2 or write transmit data buffer 2 */
    byte R3T3        :1;                                       /* Read receive data buffer 3 or write transmit data buffer 3 */
    byte R4T4        :1;                                       /* Read receive data buffer 4 or write transmit data buffer 4 */
    byte R5T5        :1;                                       /* Read receive data buffer 5 or write transmit data buffer 5 */
    byte R6T6        :1;                                       /* Read receive data buffer 6 or write transmit data buffer 6 */
    byte R7T7        :1;                                       /* Read receive data buffer 7 or write transmit data buffer 7 */
  } Bits;
} SCI1_DSTR;
extern volatile SCI1_DSTR _SCI1_D @0x0000308F;
#define SCI1_D                          _SCI1_D.Byte
#define SCI1_D_R0T0                     _SCI1_D.Bits.R0T0
#define SCI1_D_R1T1                     _SCI1_D.Bits.R1T1
#define SCI1_D_R2T2                     _SCI1_D.Bits.R2T2
#define SCI1_D_R3T3                     _SCI1_D.Bits.R3T3
#define SCI1_D_R4T4                     _SCI1_D.Bits.R4T4
#define SCI1_D_R5T5                     _SCI1_D.Bits.R5T5
#define SCI1_D_R6T6                     _SCI1_D.Bits.R6T6
#define SCI1_D_R7T7                     _SCI1_D.Bits.R7T7

#define SCI1_D_R0T0_MASK                0x01U
#define SCI1_D_R1T1_MASK                0x02U
#define SCI1_D_R2T2_MASK                0x04U
#define SCI1_D_R3T3_MASK                0x08U
#define SCI1_D_R4T4_MASK                0x10U
#define SCI1_D_R5T5_MASK                0x20U
#define SCI1_D_R6T6_MASK                0x40U
#define SCI1_D_R7T7_MASK                0x80U


/*** SCI2_BD - SCI2 Baud Rate Register; 0x00003090 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI2_BDH - SCI Baud Rate Register: High; 0x00003090 ***/
    union {
      byte Byte;
      struct {
        byte SBR0        :1;                                       /* Baud Rate Modulo Divisor, bit 0 */
        byte SBR1        :1;                                       /* Baud Rate Modulo Divisor, bit 1 */
        byte SBR2        :1;                                       /* Baud Rate Modulo Divisor, bit 2 */
        byte SBR3        :1;                                       /* Baud Rate Modulo Divisor, bit 3 */
        byte SBR4        :1;                                       /* Baud Rate Modulo Divisor, bit 4 */
        byte SBNS        :1;                                       /* Stop Bit Number Select */
        byte RXEDGIE     :1;                                       /* RxD Input Active Edge Interrupt Enable (for RXEDGIF) */
        byte LBKDIE      :1;                                       /* LIN Break Detect Interrupt Enable (for LBKDIF) */
      } Bits;
      struct {
        byte grpSBR :5;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI2_BDHSTR;
    #define SCI2_BDH                    _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Byte
    #define SCI2_BDH_SBR0               _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.SBR0
    #define SCI2_BDH_SBR1               _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.SBR1
    #define SCI2_BDH_SBR2               _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.SBR2
    #define SCI2_BDH_SBR3               _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.SBR3
    #define SCI2_BDH_SBR4               _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.SBR4
    #define SCI2_BDH_SBNS               _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.SBNS
    #define SCI2_BDH_RXEDGIE            _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.RXEDGIE
    #define SCI2_BDH_LBKDIE             _SCI2_BD.Overlap_STR.SCI2_BDHSTR.Bits.LBKDIE
    #define SCI2_BDH_SBR                _SCI2_BD.Overlap_STR.SCI2_BDHSTR.MergedBits.grpSBR
    
    #define SCI2_BDH_SBR0_MASK          0x01U
    #define SCI2_BDH_SBR1_MASK          0x02U
    #define SCI2_BDH_SBR2_MASK          0x04U
    #define SCI2_BDH_SBR3_MASK          0x08U
    #define SCI2_BDH_SBR4_MASK          0x10U
    #define SCI2_BDH_SBNS_MASK          0x20U
    #define SCI2_BDH_RXEDGIE_MASK       0x40U
    #define SCI2_BDH_LBKDIE_MASK        0x80U
    #define SCI2_BDH_SBR_MASK           0x1FU
    #define SCI2_BDH_SBR_BITNUM         0x00U
    

    /*** SCI2_BDL - SCI Baud Rate Register: Low; 0x00003091 ***/
    union {
      byte Byte;
      struct {
        byte SBR0        :1;                                       /* Baud Rate Modulo Divisor, bit 0 */
        byte SBR1        :1;                                       /* Baud Rate Modulo Divisor, bit 1 */
        byte SBR2        :1;                                       /* Baud Rate Modulo Divisor, bit 2 */
        byte SBR3        :1;                                       /* Baud Rate Modulo Divisor, bit 3 */
        byte SBR4        :1;                                       /* Baud Rate Modulo Divisor, bit 4 */
        byte SBR5        :1;                                       /* Baud Rate Modulo Divisor, bit 5 */
        byte SBR6        :1;                                       /* Baud Rate Modulo Divisor, bit 6 */
        byte SBR7        :1;                                       /* Baud Rate Modulo Divisor, bit 7 */
      } Bits;
    } SCI2_BDLSTR;
    #define SCI2_BDL                    _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Byte
    #define SCI2_BDL_SBR0               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR0
    #define SCI2_BDL_SBR1               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR1
    #define SCI2_BDL_SBR2               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR2
    #define SCI2_BDL_SBR3               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR3
    #define SCI2_BDL_SBR4               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR4
    #define SCI2_BDL_SBR5               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR5
    #define SCI2_BDL_SBR6               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR6
    #define SCI2_BDL_SBR7               _SCI2_BD.Overlap_STR.SCI2_BDLSTR.Bits.SBR7
    
    #define SCI2_BDL_SBR0_MASK          0x01U
    #define SCI2_BDL_SBR1_MASK          0x02U
    #define SCI2_BDL_SBR2_MASK          0x04U
    #define SCI2_BDL_SBR3_MASK          0x08U
    #define SCI2_BDL_SBR4_MASK          0x10U
    #define SCI2_BDL_SBR5_MASK          0x20U
    #define SCI2_BDL_SBR6_MASK          0x40U
    #define SCI2_BDL_SBR7_MASK          0x80U
    
  } Overlap_STR;

