LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
} SCI2_BDSTR;
extern volatile SCI2_BDSTR _SCI2_BD @0x00003090;
#define SCI2_BD                         _SCI2_BD.Word


/*** SCI2_C1 - SCI Control Register 1; 0x00003092 ***/
typedef union {
  byte Byte;
  struct {
    byte PT          :1;                                       /* Parity Type */
    byte PE          :1;                                       /* Parity Enable */
    byte ILT         :1;                                       /* Idle Line Type Select */
    byte WAKE        :1;                                       /* Receiver Wakeup Method Select */
    byte M           :1;                                       /* 9-Bit or 8-Bit Mode Select */
    byte RSRC        :1;                                       /* Receiver Source Select */
    byte SCISWAI     :1;                                       /* SCI Stops in Wait Mode */
    byte LOOPS       :1;                                       /* Loop Mode Select */
  } Bits;
} SCI2_C1STR;
extern volatile SCI2_C1STR _SCI2_C1 @0x00003092;
#define SCI2_C1                         _SCI2_C1.Byte
#define SCI2_C1_PT                      _SCI2_C1.Bits.PT
#define SCI2_C1_PE                      _SCI2_C1.Bits.PE
#define SCI2_C1_ILT                     _SCI2_C1.Bits.ILT
#define SCI2_C1_WAKE                    _SCI2_C1.Bits.WAKE
#define SCI2_C1_M                       _SCI2_C1.Bits.M
#define SCI2_C1_RSRC                    _SCI2_C1.Bits.RSRC
#define SCI2_C1_SCISWAI                 _SCI2_C1.Bits.SCISWAI
#define SCI2_C1_LOOPS                   _SCI2_C1.Bits.LOOPS

#define SCI2_C1_PT_MASK                 0x01U
#define SCI2_C1_PE_MASK                 0x02U
#define SCI2_C1_ILT_MASK                0x04U
#define SCI2_C1_WAKE_MASK               0x08U
#define SCI2_C1_M_MASK                  0x10U
#define SCI2_C1_RSRC_MASK               0x20U
#define SCI2_C1_SCISWAI_MASK            0x40U
#define SCI2_C1_LOOPS_MASK              0x80U


/*** SCI2_C2 - SCI Control Register 2; 0x00003093 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break */
    byte RWU         :1;                                       /* Receiver Wakeup Control */
    byte RE          :1;                                       /* Receiver Enable */
    byte TE          :1;                                       /* Transmitter Enable */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable for IDLE */
    byte RIE         :1;                                       /* Receiver Interrupt Enable for RDRF */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable for TC */
    byte TIE         :1;                                       /* Transmit Interrupt Enable for TDRE */
  } Bits;
} SCI2_C2STR;
extern volatile SCI2_C2STR _SCI2_C2 @0x00003093;
#define SCI2_C2                         _SCI2_C2.Byte
#define SCI2_C2_SBK                     _SCI2_C2.Bits.SBK
#define SCI2_C2_RWU                     _SCI2_C2.Bits.RWU
#define SCI2_C2_RE                      _SCI2_C2.Bits.RE
#define SCI2_C2_TE                      _SCI2_C2.Bits.TE
#define SCI2_C2_ILIE                    _SCI2_C2.Bits.ILIE
#define SCI2_C2_RIE                     _SCI2_C2.Bits.RIE
#define SCI2_C2_TCIE                    _SCI2_C2.Bits.TCIE
#define SCI2_C2_TIE                     _SCI2_C2.Bits.TIE

#define SCI2_C2_SBK_MASK                0x01U
#define SCI2_C2_RWU_MASK                0x02U
#define SCI2_C2_RE_MASK                 0x04U
#define SCI2_C2_TE_MASK                 0x08U
#define SCI2_C2_ILIE_MASK               0x10U
#define SCI2_C2_RIE_MASK                0x20U
#define SCI2_C2_TCIE_MASK               0x40U
#define SCI2_C2_TIE_MASK                0x80U


/*** SCI2_S1 - SCI Status Register 1; 0x00003094 ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Receiver Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF        :1;                                       /* Receive Data Register Full Flag */
    byte TC          :1;                                       /* Transmission Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI2_S1STR;
extern volatile SCI2_S1STR _SCI2_S1 @0x00003094;
#define SCI2_S1                         _SCI2_S1.Byte
#define SCI2_S1_PF                      _SCI2_S1.Bits.PF
#define SCI2_S1_FE                      _SCI2_S1.Bits.FE
#define SCI2_S1_NF                      _SCI2_S1.Bits.NF
#define SCI2_S1_OR                      _SCI2_S1.Bits.OR
#define SCI2_S1_IDLE                    _SCI2_S1.Bits.IDLE
#define SCI2_S1_RDRF                    _SCI2_S1.Bits.RDRF
#define SCI2_S1_TC                      _SCI2_S1.Bits.TC
#define SCI2_S1_TDRE                    _SCI2_S1.Bits.TDRE

#define SCI2_S1_PF_MASK                 0x01U
#define SCI2_S1_FE_MASK                 0x02U
#define SCI2_S1_NF_MASK                 0x04U
#define SCI2_S1_OR_MASK                 0x08U
#define SCI2_S1_IDLE_MASK               0x10U
#define SCI2_S1_RDRF_MASK               0x20U
#define SCI2_S1_TC_MASK                 0x40U
#define SCI2_S1_TDRE_MASK               0x80U


/*** SCI2_S2 - SCI Status Register 2; 0x00003095 ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte LBKDE       :1;                                       /* LIN Break Detection Enable */
    byte BRK13       :1;                                       /* Break Character Generation Length */
    byte RWUID       :1;                                       /* Receive Wake Up Idle Detect */
    byte RXINV       :1;                                       /* Receive Data Inversion */
    byte             :1; 
    byte RXEDGIF     :1;                                       /* RxD Pin Active Edge Interrupt Flag */
    byte LBKDIF      :1;                                       /* LIN Break Detect Interrupt Flag */
  } Bits;
} SCI2_S2STR;
extern volatile SCI2_S2STR _SCI2_S2 @0x00003095;
#define SCI2_S2                         _SCI2_S2.Byte
#define SCI2_S2_RAF                     _SCI2_S2.Bits.RAF
#define SCI2_S2_LBKDE                   _SCI2_S2.Bits.LBKDE
#define SCI2_S2_BRK13                   _SCI2_S2.Bits.BRK13
#define SCI2_S2_RWUID                   _SCI2_S2.Bits.RWUID
#define SCI2_S2_RXINV                   _SCI2_S2.Bits.RXINV
#define SCI2_S2_RXEDGIF                 _SCI2_S2.Bits.RXEDGIF
#define SCI2_S2_LBKDIF                  _SCI2_S2.Bits.LBKDIF

#define SCI2_S2_RAF_MASK                0x01U
#define SCI2_S2_LBKDE_MASK              0x02U
#define SCI2_S2_BRK13_MASK              0x04U
#define SCI2_S2_RWUID_MASK              0x08U
#define SCI2_S2_RXINV_MASK              0x10U
#define SCI2_S2_RXEDGIF_MASK            0x40U
#define SCI2_S2_LBKDIF_MASK             0x80U


/*** SCI2_C3 - SCI Control Register 3; 0x00003096 ***/
typedef union {
  byte Byte;
  struct {
    byte PEIE        :1;                                       /* Parity Error Interrupt Enable */
    byte FEIE        :1;                                       /* Framing Error Interrupt Enable */
    byte NEIE        :1;                                       /* Noise Error Interrupt Enable */
    byte ORIE        :1;                                       /* Overrun Interrupt Enable */
    byte TXINV       :1;                                       /* Transmit Data Inversion */
    byte TXDIR       :1;                                       /* TxD Pin Direction in Single-Wire Mode */
    byte T8          :1;                                       /* Ninth Data Bit for Transmitter */
    byte R8          :1;                                       /* Ninth Data Bit for Receiver */
  } Bits;
} SCI2_C3STR;
extern volatile SCI2_C3STR _SCI2_C3 @0x00003096;
#define SCI2_C3                         _SCI2_C3.Byte
#define SCI2_C3_PEIE                    _SCI2_C3.Bits.PEIE
#define SCI2_C3_FEIE                    _SCI2_C3.Bits.FEIE
#define SCI2_C3_NEIE                    _SCI2_C3.Bits.NEIE
#define SCI2_C3_ORIE                    _SCI2_C3.Bits.ORIE
#define SCI2_C3_TXINV                   _SCI2_C3.Bits.TXINV
#define SCI2_C3_TXDIR                   _SCI2_C3.Bits.TXDIR
#define SCI2_C3_T8                      _SCI2_C3.Bits.T8
#define SCI2_C3_R8                      _SCI2_C3.Bits.R8

#define SCI2_C3_PEIE_MASK               0x01U
#define SCI2_C3_FEIE_MASK               0x02U
#define SCI2_C3_NEIE_MASK               0x04U
#define SCI2_C3_ORIE_MASK               0x08U
#define SCI2_C3_TXINV_MASK              0x10U
#define SCI2_C3_TXDIR_MASK              0x20U
#define SCI2_C3_T8_MASK                 0x40U
#define SCI2_C3_R8_MASK                 0x80U


/*** SCI2_D - SCI Data Register; 0x00003097 ***/
typedef union {
  byte Byte;
  struct {
    byte R0T0        :1;                                       /* Read receive data buffer 0 or write transmit data buffer 0 */
    byte R1T1        :1;                                       /* Read receive data buffer 1 or write transmit data buffer 1 */
    byte R2T2        :1;                                       /* Read receive data buffer 2 or write transmit data buffer 2 */
    byte R3T3        :1;                                       /* Read receive data buffer 3 or write transmit data buffer 3 */
    byte R4T4        :1;                                       /* Read receive data buffer 4 or write transmit data buffer 4 */
    byte R5T5        :1;                                       /* Read receive data buffer 5 or write transmit data buffer 5 */
    byte R6T6        :1;                                       /* Read receive data buffer 6 or write transmit data buffer 6 */
    byte R7T7        :1;                                       /* Read receive data buffer 7 or write transmit data buffer 7 */
  } Bits;
} SCI2_DSTR;
extern volatile SCI2_DSTR _SCI2_D @0x00003097;
#define SCI2_D                          _SCI2_D.Byte
#define SCI2_D_R0T0                     _SCI2_D.Bits.R0T0
#define SCI2_D_R1T1                     _SCI2_D.Bits.R1T1
#define SCI2_D_R2T2                     _SCI2_D.Bits.R2T2
#define SCI2_D_R3T3                     _SCI2_D.Bits.R3T3
#define SCI2_D_R4T4                     _SCI2_D.Bits.R4T4
#define SCI2_D_R5T5                     _SCI2_D.Bits.R5T5
#define SCI2_D_R6T6                     _SCI2_D.Bits.R6T6
#define SCI2_D_R7T7                     _SCI2_D.Bits.R7T7

