LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
extern volatile SPI0_SSTR _SPI0_S @0x0000309B;
#define SPI0_S                          _SPI0_S.Byte
#define SPI0_S_MODF                     _SPI0_S.Bits.MODF
#define SPI0_S_SPTEF                    _SPI0_S.Bits.SPTEF
#define SPI0_S_SPMF                     _SPI0_S.Bits.SPMF
#define SPI0_S_SPRF                     _SPI0_S.Bits.SPRF

#define SPI0_S_MODF_MASK                0x10U
#define SPI0_S_SPTEF_MASK               0x20U
#define SPI0_S_SPMF_MASK                0x40U
#define SPI0_S_SPRF_MASK                0x80U


/*** SPI0_D - SPI data register low; 0x0000309D ***/
typedef union {
  byte Byte;
} SPI0_DSTR;
extern volatile SPI0_DSTR _SPI0_D @0x0000309D;
#define SPI0_D                          _SPI0_D.Byte


/*** SPI0_M - SPI match register low; 0x0000309F ***/
typedef union {
  byte Byte;
} SPI0_MSTR;
extern volatile SPI0_MSTR _SPI0_M @0x0000309F;
#define SPI0_M                          _SPI0_M.Byte


/*** SPI1_C1 - SPI control register 1; 0x000030A0 ***/
typedef union {
  byte Byte;
  struct {
    byte LSBFE       :1;                                       /* LSB first (shifter direction) */
    byte SSOE        :1;                                       /* Slave select output enable */
    byte CPHA        :1;                                       /* Clock phase */
    byte CPOL        :1;                                       /* Clock polarity */
    byte MSTR        :1;                                       /* Master/slave mode select */
    byte SPTIE       :1;                                       /* SPI transmit interrupt enable */
    byte SPE         :1;                                       /* SPI system enable */
    byte SPIE        :1;                                       /* SPI interrupt enable: for SPRF and MODF (when FIFO is not supported or not enabled) or for read FIFO (when FIFO is supported and enabled) */
  } Bits;
} SPI1_C1STR;
extern volatile SPI1_C1STR _SPI1_C1 @0x000030A0;
#define SPI1_C1                         _SPI1_C1.Byte
#define SPI1_C1_LSBFE                   _SPI1_C1.Bits.LSBFE
#define SPI1_C1_SSOE                    _SPI1_C1.Bits.SSOE
#define SPI1_C1_CPHA                    _SPI1_C1.Bits.CPHA
#define SPI1_C1_CPOL                    _SPI1_C1.Bits.CPOL
#define SPI1_C1_MSTR                    _SPI1_C1.Bits.MSTR
#define SPI1_C1_SPTIE                   _SPI1_C1.Bits.SPTIE
#define SPI1_C1_SPE                     _SPI1_C1.Bits.SPE
#define SPI1_C1_SPIE                    _SPI1_C1.Bits.SPIE

#define SPI1_C1_LSBFE_MASK              0x01U
#define SPI1_C1_SSOE_MASK               0x02U
#define SPI1_C1_CPHA_MASK               0x04U
#define SPI1_C1_CPOL_MASK               0x08U
#define SPI1_C1_MSTR_MASK               0x10U
#define SPI1_C1_SPTIE_MASK              0x20U
#define SPI1_C1_SPE_MASK                0x40U
#define SPI1_C1_SPIE_MASK               0x80U


/*** SPI1_C2 - SPI control register 2; 0x000030A1 ***/
typedef union {
  byte Byte;
  struct {
    byte SPC0        :1;                                       /* SPI pin control 0 */
    byte SPISWAI     :1;                                       /* SPI stop in wait mode */
    byte             :1; 
    byte BIDIROE     :1;                                       /* Bidirectional mode output enable */
    byte MODFEN      :1;                                       /* Master mode-fault function enable */
    byte             :1; 
    byte SPIMODE     :1;                                       /* SPI 8-bit or 16-bit mode */
    byte SPMIE       :1;                                       /* SPI match interrupt enable */
  } Bits;
} SPI1_C2STR;
extern volatile SPI1_C2STR _SPI1_C2 @0x000030A1;
#define SPI1_C2                         _SPI1_C2.Byte
#define SPI1_C2_SPC0                    _SPI1_C2.Bits.SPC0
#define SPI1_C2_SPISWAI                 _SPI1_C2.Bits.SPISWAI
#define SPI1_C2_BIDIROE                 _SPI1_C2.Bits.BIDIROE
#define SPI1_C2_MODFEN                  _SPI1_C2.Bits.MODFEN
#define SPI1_C2_SPIMODE                 _SPI1_C2.Bits.SPIMODE
#define SPI1_C2_SPMIE                   _SPI1_C2.Bits.SPMIE

#define SPI1_C2_SPC0_MASK               0x01U
#define SPI1_C2_SPISWAI_MASK            0x02U
#define SPI1_C2_BIDIROE_MASK            0x08U
#define SPI1_C2_MODFEN_MASK             0x10U
#define SPI1_C2_SPIMODE_MASK            0x40U
#define SPI1_C2_SPMIE_MASK              0x80U


/*** SPI1_BR - SPI baud rate register; 0x000030A2 ***/
typedef union {
  byte Byte;
  struct {
    byte SPR0        :1;                                       /* SPI baud rate divisor, bit 0 */
    byte SPR1        :1;                                       /* SPI baud rate divisor, bit 1 */
    byte SPR2        :1;                                       /* SPI baud rate divisor, bit 2 */
    byte SPR3        :1;                                       /* SPI baud rate divisor, bit 3 */
    byte SPPR0       :1;                                       /* SPI baud rate prescale divisor, bit 0 */
    byte SPPR1       :1;                                       /* SPI baud rate prescale divisor, bit 1 */
    byte SPPR2       :1;                                       /* SPI baud rate prescale divisor, bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpSPR  :4;
    byte grpSPPR :3;
    byte         :1;
  } MergedBits;
} SPI1_BRSTR;
extern volatile SPI1_BRSTR _SPI1_BR @0x000030A2;
#define SPI1_BR                         _SPI1_BR.Byte
#define SPI1_BR_SPR0                    _SPI1_BR.Bits.SPR0
#define SPI1_BR_SPR1                    _SPI1_BR.Bits.SPR1
#define SPI1_BR_SPR2                    _SPI1_BR.Bits.SPR2
#define SPI1_BR_SPR3                    _SPI1_BR.Bits.SPR3
#define SPI1_BR_SPPR0                   _SPI1_BR.Bits.SPPR0
#define SPI1_BR_SPPR1                   _SPI1_BR.Bits.SPPR1
#define SPI1_BR_SPPR2                   _SPI1_BR.Bits.SPPR2
#define SPI1_BR_SPR                     _SPI1_BR.MergedBits.grpSPR
#define SPI1_BR_SPPR                    _SPI1_BR.MergedBits.grpSPPR

#define SPI1_BR_SPR0_MASK               0x01U
#define SPI1_BR_SPR1_MASK               0x02U
#define SPI1_BR_SPR2_MASK               0x04U
#define SPI1_BR_SPR3_MASK               0x08U
#define SPI1_BR_SPPR0_MASK              0x10U
#define SPI1_BR_SPPR1_MASK              0x20U
#define SPI1_BR_SPPR2_MASK              0x40U
#define SPI1_BR_SPR_MASK                0x0FU
#define SPI1_BR_SPR_BITNUM              0x00U
#define SPI1_BR_SPPR_MASK               0x70U
#define SPI1_BR_SPPR_BITNUM             0x04U


/*** SPI1_S - SPI status register; 0x000030A3 ***/
typedef union {
  byte Byte;
  struct {
    byte RFIFOEF     :1;                                       /* SPI read FIFO empty flag */
    byte TXFULLF     :1;                                       /* Transmit FIFO full flag */
    byte TNEAREF     :1;                                       /* Transmit FIFO nearly empty flag */
    byte RNFULLF     :1;                                       /* Receive FIFO nearly full flag */
    byte MODF        :1;                                       /* Master mode fault flag */
    byte SPTEF       :1;                                       /* SPI transmit buffer empty flag (when FIFO is not supported or not enabled) or SPI transmit FIFO empty flag (when FIFO is supported and enabled) */
    byte SPMF        :1;                                       /* SPI match flag */
    byte SPRF        :1;                                       /* SPI read buffer full flag (when FIFO is not supported or not enabled) or SPI read FIFO FULL flag (when FIFO is supported and enabled) */
  } Bits;
} SPI1_SSTR;
extern volatile SPI1_SSTR _SPI1_S @0x000030A3;
#define SPI1_S                          _SPI1_S.Byte
#define SPI1_S_RFIFOEF                  _SPI1_S.Bits.RFIFOEF
#define SPI1_S_TXFULLF                  _SPI1_S.Bits.TXFULLF
#define SPI1_S_TNEAREF                  _SPI1_S.Bits.TNEAREF
#define SPI1_S_RNFULLF                  _SPI1_S.Bits.RNFULLF
#define SPI1_S_MODF                     _SPI1_S.Bits.MODF
#define SPI1_S_SPTEF                    _SPI1_S.Bits.SPTEF
#define SPI1_S_SPMF                     _SPI1_S.Bits.SPMF
#define SPI1_S_SPRF                     _SPI1_S.Bits.SPRF

