LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
#define SPI1_S_RFIFOEF_MASK             0x01U
#define SPI1_S_TXFULLF_MASK             0x02U
#define SPI1_S_TNEAREF_MASK             0x04U
#define SPI1_S_RNFULLF_MASK             0x08U
#define SPI1_S_MODF_MASK                0x10U
#define SPI1_S_SPTEF_MASK               0x20U
#define SPI1_S_SPMF_MASK                0x40U
#define SPI1_S_SPRF_MASK                0x80U


/*** SPI1_D16 - SPI1 Data Register; 0x000030A4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SPI1_DH - SPI data register high; 0x000030A4 ***/
    union {
      byte Byte;
    } SPI1_DHSTR;
    #define SPI1_DH                     _SPI1_D16.Overlap_STR.SPI1_DHSTR.Byte
    

    /*** SPI1_DL - SPI data register low; 0x000030A5 ***/
    union {
      byte Byte;
    } SPI1_DLSTR;
    #define SPI1_DL                     _SPI1_D16.Overlap_STR.SPI1_DLSTR.Byte
    
  } Overlap_STR;

} SPI1_D16STR;
extern volatile SPI1_D16STR _SPI1_D16 @0x000030A4;
#define SPI1_D16                        _SPI1_D16.Word


/*** SPI1_M - SPI1 Match Register; 0x000030A6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SPI1_MH - SPI match register high; 0x000030A6 ***/
    union {
      byte Byte;
    } SPI1_MHSTR;
    #define SPI1_MH                     _SPI1_M.Overlap_STR.SPI1_MHSTR.Byte
    

    /*** SPI1_ML - SPI match register low; 0x000030A7 ***/
    union {
      byte Byte;
    } SPI1_MLSTR;
    #define SPI1_ML                     _SPI1_M.Overlap_STR.SPI1_MLSTR.Byte
    
  } Overlap_STR;

} SPI1_MSTR;
extern volatile SPI1_MSTR _SPI1_M @0x000030A6;
#define SPI1_M                          _SPI1_M.Word


/*** SPI1_C3 - SPI control register 3; 0x000030A8 ***/
typedef union {
  byte Byte;
  struct {
    byte FIFOMODE    :1;                                       /* FIFO mode enable */
    byte RNFULLIEN   :1;                                       /* Receive FIFO nearly full interrupt enable */
    byte TNEARIEN    :1;                                       /* Transmit FIFO nearly empty interrupt enable */
    byte INTCLR      :1;                                       /* Interrupt clearing mechanism select */
    byte RNFULLF_MARK :1;                                      /* Receive FIFO nearly full watermark */
    byte TNEAREF_MARK :1;                                      /* Transmit FIFO nearly empty watermark */
    byte             :1; 
    byte             :1; 
  } Bits;
} SPI1_C3STR;
extern volatile SPI1_C3STR _SPI1_C3 @0x000030A8;
#define SPI1_C3                         _SPI1_C3.Byte
#define SPI1_C3_FIFOMODE                _SPI1_C3.Bits.FIFOMODE
#define SPI1_C3_RNFULLIEN               _SPI1_C3.Bits.RNFULLIEN
#define SPI1_C3_TNEARIEN                _SPI1_C3.Bits.TNEARIEN
#define SPI1_C3_INTCLR                  _SPI1_C3.Bits.INTCLR
#define SPI1_C3_RNFULLF_MARK            _SPI1_C3.Bits.RNFULLF_MARK
#define SPI1_C3_TNEAREF_MARK            _SPI1_C3.Bits.TNEAREF_MARK

#define SPI1_C3_FIFOMODE_MASK           0x01U
#define SPI1_C3_RNFULLIEN_MASK          0x02U
#define SPI1_C3_TNEARIEN_MASK           0x04U
#define SPI1_C3_INTCLR_MASK             0x08U
#define SPI1_C3_RNFULLF_MARK_MASK       0x10U
#define SPI1_C3_TNEAREF_MARK_MASK       0x20U


/*** SPI1_CI - SPI clear interrupt register; 0x000030A9 ***/
typedef union {
  byte Byte;
  struct {
    byte SPRFCI      :1;                                       /* Receive FIFO full flag clear interrupt */
    byte SPTEFCI     :1;                                       /* Transmit FIFO empty flag clear interrupt */
    byte RNFULLFCI   :1;                                       /* Receive FIFO nearly full flag clear interrupt */
    byte TNEAREFCI   :1;                                       /* Transmit FIFO nearly empty flag clear interrupt */
    byte RXFOF       :1;                                       /* Receive FIFO overflow flag */
    byte TXFOF       :1;                                       /* Transmit FIFO overflow flag */
    byte RXFERR      :1;                                       /* Receive FIFO error flag */
    byte TXFERR      :1;                                       /* Transmit FIFO error flag */
  } Bits;
} SPI1_CISTR;
extern volatile SPI1_CISTR _SPI1_CI @0x000030A9;
#define SPI1_CI                         _SPI1_CI.Byte
#define SPI1_CI_SPRFCI                  _SPI1_CI.Bits.SPRFCI
#define SPI1_CI_SPTEFCI                 _SPI1_CI.Bits.SPTEFCI
#define SPI1_CI_RNFULLFCI               _SPI1_CI.Bits.RNFULLFCI
#define SPI1_CI_TNEAREFCI               _SPI1_CI.Bits.TNEAREFCI
#define SPI1_CI_RXFOF                   _SPI1_CI.Bits.RXFOF
#define SPI1_CI_TXFOF                   _SPI1_CI.Bits.TXFOF
#define SPI1_CI_RXFERR                  _SPI1_CI.Bits.RXFERR
#define SPI1_CI_TXFERR                  _SPI1_CI.Bits.TXFERR

#define SPI1_CI_SPRFCI_MASK             0x01U
#define SPI1_CI_SPTEFCI_MASK            0x02U
#define SPI1_CI_RNFULLFCI_MASK          0x04U
#define SPI1_CI_TNEAREFCI_MASK          0x08U
#define SPI1_CI_RXFOF_MASK              0x10U
#define SPI1_CI_TXFOF_MASK              0x20U
#define SPI1_CI_RXFERR_MASK             0x40U
#define SPI1_CI_TXFERR_MASK             0x80U


/*** ADC_APCTL1 - Pin Control 1 Register; 0x000030AC ***/
typedef union {
  byte Byte;
  struct {
    byte ADPC0       :1;                                       /* ADC Pin Control 0 */
    byte ADPC1       :1;                                       /* ADC Pin Control 1 */
    byte ADPC2       :1;                                       /* ADC Pin Control 2 */
    byte ADPC3       :1;                                       /* ADC Pin Control 3 */
    byte ADPC4       :1;                                       /* ADC Pin Control 4 */
    byte ADPC5       :1;                                       /* ADC Pin Control 5 */
    byte ADPC6       :1;                                       /* ADC Pin Control 6 */
    byte ADPC7       :1;                                       /* ADC Pin Control 7 */
  } Bits;
} ADC_APCTL1STR;
extern volatile ADC_APCTL1STR _ADC_APCTL1 @0x000030AC;
#define ADC_APCTL1                      _ADC_APCTL1.Byte
#define ADC_APCTL1_ADPC0                _ADC_APCTL1.Bits.ADPC0
#define ADC_APCTL1_ADPC1                _ADC_APCTL1.Bits.ADPC1
#define ADC_APCTL1_ADPC2                _ADC_APCTL1.Bits.ADPC2
#define ADC_APCTL1_ADPC3                _ADC_APCTL1.Bits.ADPC3
#define ADC_APCTL1_ADPC4                _ADC_APCTL1.Bits.ADPC4
#define ADC_APCTL1_ADPC5                _ADC_APCTL1.Bits.ADPC5
#define ADC_APCTL1_ADPC6                _ADC_APCTL1.Bits.ADPC6
#define ADC_APCTL1_ADPC7                _ADC_APCTL1.Bits.ADPC7

#define ADC_APCTL1_ADPC0_MASK           0x01U
#define ADC_APCTL1_ADPC1_MASK           0x02U
#define ADC_APCTL1_ADPC2_MASK           0x04U
#define ADC_APCTL1_ADPC3_MASK           0x08U
#define ADC_APCTL1_ADPC4_MASK           0x10U
#define ADC_APCTL1_ADPC5_MASK           0x20U
#define ADC_APCTL1_ADPC6_MASK           0x40U
#define ADC_APCTL1_ADPC7_MASK           0x80U


/*** ADC_APCTL2 - Pin Control 2 Register; 0x000030AD ***/
typedef union {
  byte Byte;
  struct {
    byte ADPC8       :1;                                       /* ADC Pin Control 8 */
    byte ADPC9       :1;                                       /* ADC Pin Control 9 */
    byte ADPC10      :1;                                       /* ADC Pin Control 10 */
    byte ADPC11      :1;                                       /* ADC Pin Control 11 */
    byte ADPC12      :1;                                       /* ADC Pin Control 12 */
    byte ADPC13      :1;                                       /* ADC Pin Control 13 */
    byte ADPC14      :1;                                       /* ADC Pin Control 14 */
    byte ADPC15      :1;                                       /* ADC Pin Control 15 */
  } Bits;
} ADC_APCTL2STR;
extern volatile ADC_APCTL2STR _ADC_APCTL2 @0x000030AD;
#define ADC_APCTL2                      _ADC_APCTL2.Byte
#define ADC_APCTL2_ADPC8                _ADC_APCTL2.Bits.ADPC8
#define ADC_APCTL2_ADPC9                _ADC_APCTL2.Bits.ADPC9
#define ADC_APCTL2_ADPC10               _ADC_APCTL2.Bits.ADPC10
#define ADC_APCTL2_ADPC11               _ADC_APCTL2.Bits.ADPC11
#define ADC_APCTL2_ADPC12               _ADC_APCTL2.Bits.ADPC12
#define ADC_APCTL2_ADPC13               _ADC_APCTL2.Bits.ADPC13
#define ADC_APCTL2_ADPC14               _ADC_APCTL2.Bits.ADPC14
#define ADC_APCTL2_ADPC15               _ADC_APCTL2.Bits.ADPC15

#define ADC_APCTL2_ADPC8_MASK           0x01U
#define ADC_APCTL2_ADPC9_MASK           0x02U
#define ADC_APCTL2_ADPC10_MASK          0x04U
#define ADC_APCTL2_ADPC11_MASK          0x08U
#define ADC_APCTL2_ADPC12_MASK          0x10U
#define ADC_APCTL2_ADPC13_MASK          0x20U
#define ADC_APCTL2_ADPC14_MASK          0x40U
#define ADC_APCTL2_ADPC15_MASK          0x80U


/*** PORT_HDRVE - Port High Drive Enable Register; 0x000030AF ***/
typedef union {
  byte Byte;
  struct {
    byte PTB4        :1;                                       /* PTB4 */
    byte PTB5        :1;                                       /* PTB5 */
    byte PTD0        :1;                                       /* PTD0 */
    byte PTD1        :1;                                       /* PTD1 */
    byte PTE0        :1;                                       /* PTE0 */
    byte PTE1        :1;                                       /* PTE1 */
    byte PTH0        :1;                                       /* PTH0 */
    byte PTH1        :1;                                       /* PTH1 */
  } Bits;
  struct {
    byte grpPTB_4 :2;
    byte grpPTD  :2;
    byte grpPTE  :2;
    byte grpPTH  :2;
  } MergedBits;
} PORT_HDRVESTR;
