LuoFelix/MC9S08PT60V/AUX_Display_Panel/Generated_Code/IO_Map.h
/*** FTM2_FLTFILTER - Fault Input Filter Control; 0x000030E8 ***/
typedef union {
  byte Byte;
  struct {
    byte FFVAL0      :1;                                       /* Fault Input Filter, bit 0 */
    byte FFVAL1      :1;                                       /* Fault Input Filter, bit 1 */
    byte FFVAL2      :1;                                       /* Fault Input Filter, bit 2 */
    byte FFVAL3      :1;                                       /* Fault Input Filter, bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpFFVAL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM2_FLTFILTERSTR;
extern volatile FTM2_FLTFILTERSTR _FTM2_FLTFILTER @0x000030E8;
#define FTM2_FLTFILTER                  _FTM2_FLTFILTER.Byte
#define FTM2_FLTFILTER_FFVAL0           _FTM2_FLTFILTER.Bits.FFVAL0
#define FTM2_FLTFILTER_FFVAL1           _FTM2_FLTFILTER.Bits.FFVAL1
#define FTM2_FLTFILTER_FFVAL2           _FTM2_FLTFILTER.Bits.FFVAL2
#define FTM2_FLTFILTER_FFVAL3           _FTM2_FLTFILTER.Bits.FFVAL3
#define FTM2_FLTFILTER_FFVAL            _FTM2_FLTFILTER.MergedBits.grpFFVAL

#define FTM2_FLTFILTER_FFVAL0_MASK      0x01U
#define FTM2_FLTFILTER_FFVAL1_MASK      0x02U
#define FTM2_FLTFILTER_FFVAL2_MASK      0x04U
#define FTM2_FLTFILTER_FFVAL3_MASK      0x08U
#define FTM2_FLTFILTER_FFVAL_MASK       0x0FU
#define FTM2_FLTFILTER_FFVAL_BITNUM     0x00U


/*** FTM2_FLTCTRL - Fault Input Control; 0x000030E9 ***/
typedef union {
  byte Byte;
  struct {
    byte FAULT0EN    :1;                                       /* Fault Input 0 Enable */
    byte FAULT1EN    :1;                                       /* Fault Input 1 Enable */
    byte FAULT2EN    :1;                                       /* Fault Input 2 Enable */
    byte FAULT3EN    :1;                                       /* Fault Input 3 Enable */
    byte FFLTR0EN    :1;                                       /* Fault Input 0 Filter Enable */
    byte FFLTR1EN    :1;                                       /* Fault Input 1 Filter Enable */
    byte FFLTR2EN    :1;                                       /* Fault Input 2 Filter Enable */
    byte FFLTR3EN    :1;                                       /* Fault Input 3 Filter Enable */
  } Bits;
} FTM2_FLTCTRLSTR;
extern volatile FTM2_FLTCTRLSTR _FTM2_FLTCTRL @0x000030E9;
#define FTM2_FLTCTRL                    _FTM2_FLTCTRL.Byte
#define FTM2_FLTCTRL_FAULT0EN           _FTM2_FLTCTRL.Bits.FAULT0EN
#define FTM2_FLTCTRL_FAULT1EN           _FTM2_FLTCTRL.Bits.FAULT1EN
#define FTM2_FLTCTRL_FAULT2EN           _FTM2_FLTCTRL.Bits.FAULT2EN
#define FTM2_FLTCTRL_FAULT3EN           _FTM2_FLTCTRL.Bits.FAULT3EN
#define FTM2_FLTCTRL_FFLTR0EN           _FTM2_FLTCTRL.Bits.FFLTR0EN
#define FTM2_FLTCTRL_FFLTR1EN           _FTM2_FLTCTRL.Bits.FFLTR1EN
#define FTM2_FLTCTRL_FFLTR2EN           _FTM2_FLTCTRL.Bits.FFLTR2EN
#define FTM2_FLTCTRL_FFLTR3EN           _FTM2_FLTCTRL.Bits.FFLTR3EN

#define FTM2_FLTCTRL_FAULT0EN_MASK      0x01U
#define FTM2_FLTCTRL_FAULT1EN_MASK      0x02U
#define FTM2_FLTCTRL_FAULT2EN_MASK      0x04U
#define FTM2_FLTCTRL_FAULT3EN_MASK      0x08U
#define FTM2_FLTCTRL_FFLTR0EN_MASK      0x10U
#define FTM2_FLTCTRL_FFLTR1EN_MASK      0x20U
#define FTM2_FLTCTRL_FFLTR2EN_MASK      0x40U
#define FTM2_FLTCTRL_FFLTR3EN_MASK      0x80U


/*** PORT_IOFLT0 - Port Filter Register 0; 0x000030EC ***/
typedef union {
  byte Byte;
  struct {
    byte FLTA0       :1;                                       /* Filter selection for input from PTA, bit 0 */
    byte FLTA1       :1;                                       /* Filter selection for input from PTA, bit 1 */
    byte FLTB0       :1;                                       /* Filter selection for input from PTB, bit 0 */
    byte FLTB1       :1;                                       /* Filter selection for input from PTB, bit 1 */
    byte FLTC0       :1;                                       /* Filter selection for input from PTC, bit 0 */
    byte FLTC1       :1;                                       /* Filter selection for input from PTC, bit 1 */
    byte FLTD0       :1;                                       /* Filter selection for input from PTD, bit 0 */
    byte FLTD1       :1;                                       /* Filter selection for input from PTD, bit 1 */
  } Bits;
  struct {
    byte grpFLTA :2;
    byte grpFLTB :2;
    byte grpFLTC :2;
    byte grpFLTD :2;
  } MergedBits;
} PORT_IOFLT0STR;
extern volatile PORT_IOFLT0STR _PORT_IOFLT0 @0x000030EC;
#define PORT_IOFLT0                     _PORT_IOFLT0.Byte
#define PORT_IOFLT0_FLTA0               _PORT_IOFLT0.Bits.FLTA0
#define PORT_IOFLT0_FLTA1               _PORT_IOFLT0.Bits.FLTA1
#define PORT_IOFLT0_FLTB0               _PORT_IOFLT0.Bits.FLTB0
#define PORT_IOFLT0_FLTB1               _PORT_IOFLT0.Bits.FLTB1
#define PORT_IOFLT0_FLTC0               _PORT_IOFLT0.Bits.FLTC0
#define PORT_IOFLT0_FLTC1               _PORT_IOFLT0.Bits.FLTC1
#define PORT_IOFLT0_FLTD0               _PORT_IOFLT0.Bits.FLTD0
#define PORT_IOFLT0_FLTD1               _PORT_IOFLT0.Bits.FLTD1
/* PORT_IOFLT_ARR: Access 3 PORT_IOFLTx registers in an array */
#define PORT_IOFLT_ARR                  ((volatile byte * __far) &PORT_IOFLT0)
#define PORT_IOFLT0_FLTA                _PORT_IOFLT0.MergedBits.grpFLTA
#define PORT_IOFLT0_FLTB                _PORT_IOFLT0.MergedBits.grpFLTB
#define PORT_IOFLT0_FLTC                _PORT_IOFLT0.MergedBits.grpFLTC
#define PORT_IOFLT0_FLTD                _PORT_IOFLT0.MergedBits.grpFLTD

#define PORT_IOFLT0_FLTA0_MASK          0x01U
#define PORT_IOFLT0_FLTA1_MASK          0x02U
#define PORT_IOFLT0_FLTB0_MASK          0x04U
#define PORT_IOFLT0_FLTB1_MASK          0x08U
#define PORT_IOFLT0_FLTC0_MASK          0x10U
#define PORT_IOFLT0_FLTC1_MASK          0x20U
#define PORT_IOFLT0_FLTD0_MASK          0x40U
#define PORT_IOFLT0_FLTD1_MASK          0x80U
#define PORT_IOFLT0_FLTA_MASK           0x03U
#define PORT_IOFLT0_FLTA_BITNUM         0x00U
#define PORT_IOFLT0_FLTB_MASK           0x0CU
#define PORT_IOFLT0_FLTB_BITNUM         0x02U
#define PORT_IOFLT0_FLTC_MASK           0x30U
#define PORT_IOFLT0_FLTC_BITNUM         0x04U
#define PORT_IOFLT0_FLTD_MASK           0xC0U
#define PORT_IOFLT0_FLTD_BITNUM         0x06U


/*** PORT_IOFLT1 - Port Filter Register 1; 0x000030ED ***/
typedef union {
  byte Byte;
  struct {
    byte FLTE0       :1;                                       /* Filter selection for input from PTE, bit 0 */
    byte FLTE1       :1;                                       /* Filter selection for input from PTE, bit 1 */
    byte FLTF0       :1;                                       /* Filter selection for input from PTF, bit 0 */
    byte FLTF1       :1;                                       /* Filter selection for input from PTF, bit 1 */
    byte FLTG0       :1;                                       /* Filter selection for input from PTG, bit 0 */
    byte FLTG1       :1;                                       /* Filter selection for input from PTG, bit 1 */
    byte FLTH0       :1;                                       /* Filter selection for input from PTH, bit 0 */
    byte FLTH1       :1;                                       /* Filter selection for input from PTH, bit 1 */
  } Bits;
  struct {
    byte grpFLTE :2;
    byte grpFLTF :2;
    byte grpFLTG :2;
    byte grpFLTH :2;
  } MergedBits;
} PORT_IOFLT1STR;
extern volatile PORT_IOFLT1STR _PORT_IOFLT1 @0x000030ED;
#define PORT_IOFLT1                     _PORT_IOFLT1.Byte
#define PORT_IOFLT1_FLTE0               _PORT_IOFLT1.Bits.FLTE0
#define PORT_IOFLT1_FLTE1               _PORT_IOFLT1.Bits.FLTE1
#define PORT_IOFLT1_FLTF0               _PORT_IOFLT1.Bits.FLTF0
#define PORT_IOFLT1_FLTF1               _PORT_IOFLT1.Bits.FLTF1
#define PORT_IOFLT1_FLTG0               _PORT_IOFLT1.Bits.FLTG0
#define PORT_IOFLT1_FLTG1               _PORT_IOFLT1.Bits.FLTG1
#define PORT_IOFLT1_FLTH0               _PORT_IOFLT1.Bits.FLTH0
#define PORT_IOFLT1_FLTH1               _PORT_IOFLT1.Bits.FLTH1
#define PORT_IOFLT1_FLTE                _PORT_IOFLT1.MergedBits.grpFLTE
#define PORT_IOFLT1_FLTF                _PORT_IOFLT1.MergedBits.grpFLTF
#define PORT_IOFLT1_FLTG                _PORT_IOFLT1.MergedBits.grpFLTG
#define PORT_IOFLT1_FLTH                _PORT_IOFLT1.MergedBits.grpFLTH

#define PORT_IOFLT1_FLTE0_MASK          0x01U
#define PORT_IOFLT1_FLTE1_MASK          0x02U
#define PORT_IOFLT1_FLTF0_MASK          0x04U
#define PORT_IOFLT1_FLTF1_MASK          0x08U
#define PORT_IOFLT1_FLTG0_MASK          0x10U
#define PORT_IOFLT1_FLTG1_MASK          0x20U
#define PORT_IOFLT1_FLTH0_MASK          0x40U
#define PORT_IOFLT1_FLTH1_MASK          0x80U
#define PORT_IOFLT1_FLTE_MASK           0x03U
#define PORT_IOFLT1_FLTE_BITNUM         0x00U
#define PORT_IOFLT1_FLTF_MASK           0x0CU
#define PORT_IOFLT1_FLTF_BITNUM         0x02U
#define PORT_IOFLT1_FLTG_MASK           0x30U
#define PORT_IOFLT1_FLTG_BITNUM         0x04U
#define PORT_IOFLT1_FLTH_MASK           0xC0U
#define PORT_IOFLT1_FLTH_BITNUM         0x06U


/*** PORT_IOFLT2 - Port Filter Register 2; 0x000030EE ***/
typedef union {
  byte Byte;
  struct {
    byte FLTRST0     :1;                                       /* Filter selection for input from RESET/IRQ, bit 0 */
    byte FLTRST1     :1;                                       /* Filter selection for input from RESET/IRQ, bit 1 */
    byte FLTKBI00    :1;                                       /* Filter selection for input from KBI0, bit 0 */
    byte FLTKBI01    :1;                                       /* Filter selection for input from KBI0, bit 1 */
    byte FLTKBI10    :1;                                       /* Filter selection for input from KBI1, bit 0 */
    byte FLTKBI11    :1;                                       /* Filter selection for input from KBI1, bit 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpFLTRST :2;
    byte grpFLTKBI0 :2;
    byte grpFLTKBI1 :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} PORT_IOFLT2STR;
extern volatile PORT_IOFLT2STR _PORT_IOFLT2 @0x000030EE;
#define PORT_IOFLT2                     _PORT_IOFLT2.Byte
#define PORT_IOFLT2_FLTRST0             _PORT_IOFLT2.Bits.FLTRST0
#define PORT_IOFLT2_FLTRST1             _PORT_IOFLT2.Bits.FLTRST1
#define PORT_IOFLT2_FLTKBI00            _PORT_IOFLT2.Bits.FLTKBI00
#define PORT_IOFLT2_FLTKBI01            _PORT_IOFLT2.Bits.FLTKBI01
#define PORT_IOFLT2_FLTKBI10            _PORT_IOFLT2.Bits.FLTKBI10
#define PORT_IOFLT2_FLTKBI11            _PORT_IOFLT2.Bits.FLTKBI11
#define PORT_IOFLT2_FLTRST              _PORT_IOFLT2.MergedBits.grpFLTRST
#define PORT_IOFLT2_FLTKBI0             _PORT_IOFLT2.MergedBits.grpFLTKBI0
#define PORT_IOFLT2_FLTKBI1             _PORT_IOFLT2.MergedBits.grpFLTKBI1

#define PORT_IOFLT2_FLTRST0_MASK        0x01U
#define PORT_IOFLT2_FLTRST1_MASK        0x02U
#define PORT_IOFLT2_FLTKBI00_MASK       0x04U
#define PORT_IOFLT2_FLTKBI01_MASK       0x08U
#define PORT_IOFLT2_FLTKBI10_MASK       0x10U
#define PORT_IOFLT2_FLTKBI11_MASK       0x20U
#define PORT_IOFLT2_FLTRST_MASK         0x03U
#define PORT_IOFLT2_FLTRST_BITNUM       0x00U
#define PORT_IOFLT2_FLTKBI0_MASK        0x0CU
#define PORT_IOFLT2_FLTKBI0_BITNUM      0x02U
#define PORT_IOFLT2_FLTKBI1_MASK        0x30U
#define PORT_IOFLT2_FLTKBI1_BITNUM      0x04U


/*** PORT_FCLKDIV - Port Clock Division Register; 0x000030EF ***/
typedef union {
  byte Byte;
  struct {
    byte FLTDIV10    :1;                                       /* , bit 0 */
    byte FLTDIV11    :1;                                       /* , bit 1 */
    byte FLTDIV20    :1;                                       /* , bit 0 */
    byte FLTDIV21    :1;                                       /* , bit 1 */
    byte FLTDIV22    :1;                                       /* , bit 2 */
    byte FLTDIV30    :1;                                       /* , bit 0 */
    byte FLTDIV31    :1;                                       /* , bit 1 */
    byte FLTDIV32    :1;                                       /* , bit 2 */
  } Bits;
  struct {
    byte grpFLTDIV1 :2;
    byte grpFLTDIV2 :3;
    byte grpFLTDIV3 :3;
  } MergedBits;
} PORT_FCLKDIVSTR;
extern volatile PORT_FCLKDIVSTR _PORT_FCLKDIV @0x000030EF;
#define PORT_FCLKDIV                    _PORT_FCLKDIV.Byte
#define PORT_FCLKDIV_FLTDIV10           _PORT_FCLKDIV.Bits.FLTDIV10
#define PORT_FCLKDIV_FLTDIV11           _PORT_FCLKDIV.Bits.FLTDIV11
#define PORT_FCLKDIV_FLTDIV20           _PORT_FCLKDIV.Bits.FLTDIV20
#define PORT_FCLKDIV_FLTDIV21           _PORT_FCLKDIV.Bits.FLTDIV21
#define PORT_FCLKDIV_FLTDIV22           _PORT_FCLKDIV.Bits.FLTDIV22
#define PORT_FCLKDIV_FLTDIV30           _PORT_FCLKDIV.Bits.FLTDIV30
#define PORT_FCLKDIV_FLTDIV31           _PORT_FCLKDIV.Bits.FLTDIV31
#define PORT_FCLKDIV_FLTDIV32           _PORT_FCLKDIV.Bits.FLTDIV32
#define PORT_FCLKDIV_FLTDIV1            _PORT_FCLKDIV.MergedBits.grpFLTDIV1
#define PORT_FCLKDIV_FLTDIV2            _PORT_FCLKDIV.MergedBits.grpFLTDIV2
#define PORT_FCLKDIV_FLTDIV3            _PORT_FCLKDIV.MergedBits.grpFLTDIV3

#define PORT_FCLKDIV_FLTDIV10_MASK      0x01U
#define PORT_FCLKDIV_FLTDIV11_MASK      0x02U
#define PORT_FCLKDIV_FLTDIV20_MASK      0x04U
#define PORT_FCLKDIV_FLTDIV21_MASK      0x08U
#define PORT_FCLKDIV_FLTDIV22_MASK      0x10U
#define PORT_FCLKDIV_FLTDIV30_MASK      0x20U
#define PORT_FCLKDIV_FLTDIV31_MASK      0x40U
#define PORT_FCLKDIV_FLTDIV32_MASK      0x80U
#define PORT_FCLKDIV_FLTDIV1_MASK       0x03U
#define PORT_FCLKDIV_FLTDIV1_BITNUM     0x00U
#define PORT_FCLKDIV_FLTDIV2_MASK       0x1CU
#define PORT_FCLKDIV_FLTDIV2_BITNUM     0x02U
#define PORT_FCLKDIV_FLTDIV3_MASK       0xE0U
#define PORT_FCLKDIV_FLTDIV3_BITNUM     0x05U


/*** PORT_PTAPE - Port A Pullup Enable Register; 0x000030F0 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAPE0      :1;                                       /* Pull Enable for Port A Bit 0 */
    byte PTAPE1      :1;                                       /* Pull Enable for Port A Bit 1 */
    byte PTAPE2      :1;                                       /* Pull Enable for Port A Bit 2 */
    byte PTAPE3      :1;                                       /* Pull Enable for Port A Bit 3 */
    byte             :1; 
    byte PTAPE5      :1;                                       /* Pull Enable for Port A Bit 5 */
    byte PTAPE6      :1;                                       /* Pull Enable for Port A Bit 6 */
    byte PTAPE7      :1;                                       /* Pull Enable for Port A Bit 7 */
  } Bits;
  struct {
    byte grpPTAPE :4;
    byte         :1;
    byte grpPTAPE_5 :3;
  } MergedBits;
} PORT_PTAPESTR;
extern volatile PORT_PTAPESTR _PORT_PTAPE @0x000030F0;
#define PORT_PTAPE                      _PORT_PTAPE.Byte
#define PORT_PTAPE_PTAPE0               _PORT_PTAPE.Bits.PTAPE0
#define PORT_PTAPE_PTAPE1               _PORT_PTAPE.Bits.PTAPE1
#define PORT_PTAPE_PTAPE2               _PORT_PTAPE.Bits.PTAPE2
#define PORT_PTAPE_PTAPE3               _PORT_PTAPE.Bits.PTAPE3
#define PORT_PTAPE_PTAPE5               _PORT_PTAPE.Bits.PTAPE5
#define PORT_PTAPE_PTAPE6               _PORT_PTAPE.Bits.PTAPE6
#define PORT_PTAPE_PTAPE7               _PORT_PTAPE.Bits.PTAPE7
#define PORT_PTAPE_PTAPE                _PORT_PTAPE.MergedBits.grpPTAPE
#define PORT_PTAPE_PTAPE_5              _PORT_PTAPE.MergedBits.grpPTAPE_5

#define PORT_PTAPE_PTAPE0_MASK          0x01U
#define PORT_PTAPE_PTAPE1_MASK          0x02U
#define PORT_PTAPE_PTAPE2_MASK          0x04U
#define PORT_PTAPE_PTAPE3_MASK          0x08U
#define PORT_PTAPE_PTAPE5_MASK          0x20U
#define PORT_PTAPE_PTAPE6_MASK          0x40U
#define PORT_PTAPE_PTAPE7_MASK          0x80U
#define PORT_PTAPE_PTAPE_MASK           0x0FU
#define PORT_PTAPE_PTAPE_BITNUM         0x00U
#define PORT_PTAPE_PTAPE_5_MASK         0xE0U
#define PORT_PTAPE_PTAPE_5_BITNUM       0x05U


/*** PORT_PTBPE - Port B Pullup Enable Register; 0x000030F1 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBPE0      :1;                                       /* Pull Enable for Port B Bit 0 */
    byte PTBPE1      :1;                                       /* Pull Enable for Port B Bit 1 */
    byte PTBPE2      :1;                                       /* Pull Enable for Port B Bit 2 */
    byte PTBPE3      :1;                                       /* Pull Enable for Port B Bit 3 */
    byte PTBPE4      :1;                                       /* Pull Enable for Port B Bit 4 */
    byte PTBPE5      :1;                                       /* Pull Enable for Port B Bit 5 */
    byte PTBPE6      :1;                                       /* Pull Enable for Port B Bit 6 */
    byte PTBPE7      :1;                                       /* Pull Enable for Port B Bit 7 */
  } Bits;
} PORT_PTBPESTR;
extern volatile PORT_PTBPESTR _PORT_PTBPE @0x000030F1;
#define PORT_PTBPE                      _PORT_PTBPE.Byte
#define PORT_PTBPE_PTBPE0               _PORT_PTBPE.Bits.PTBPE0
#define PORT_PTBPE_PTBPE1               _PORT_PTBPE.Bits.PTBPE1
#define PORT_PTBPE_PTBPE2               _PORT_PTBPE.Bits.PTBPE2
#define PORT_PTBPE_PTBPE3               _PORT_PTBPE.Bits.PTBPE3
#define PORT_PTBPE_PTBPE4               _PORT_PTBPE.Bits.PTBPE4
#define PORT_PTBPE_PTBPE5               _PORT_PTBPE.Bits.PTBPE5
#define PORT_PTBPE_PTBPE6               _PORT_PTBPE.Bits.PTBPE6
#define PORT_PTBPE_PTBPE7               _PORT_PTBPE.Bits.PTBPE7

#define PORT_PTBPE_PTBPE0_MASK          0x01U
#define PORT_PTBPE_PTBPE1_MASK          0x02U
#define PORT_PTBPE_PTBPE2_MASK          0x04U
#define PORT_PTBPE_PTBPE3_MASK          0x08U
#define PORT_PTBPE_PTBPE4_MASK          0x10U
#define PORT_PTBPE_PTBPE5_MASK          0x20U
#define PORT_PTBPE_PTBPE6_MASK          0x40U
#define PORT_PTBPE_PTBPE7_MASK          0x80U


/*** PORT_PTCPE - Port C Pullup Enable Register; 0x000030F2 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCPE0      :1;                                       /* Pull Enable for Port C Bit 0 */
    byte PTCPE1      :1;                                       /* Pull Enable for Port C Bit 1 */
    byte PTCPE2      :1;                                       /* Pull Enable for Port C Bit 2 */
    byte PTCPE3      :1;                                       /* Pull Enable for Port C Bit 3 */
    byte PTCPE4      :1;                                       /* Pull Enable for Port C Bit 4 */
    byte PTCPE5      :1;                                       /* Pull Enable for Port C Bit 5 */
    byte PTCPE6      :1;                                       /* Pull Enable for Port C Bit 6 */
    byte PTCPE7      :1;                                       /* Pull Enable for Port C Bit 7 */
  } Bits;
} PORT_PTCPESTR;
